{
	"1_12": {
		"career": "This team has the power to bring out the very best in each other. The Aries easily inspires the Pisces, bringing excitement and zest to the table. With such strong leadership qualities, an Aries can fire up their partner, and get the ball rolling. The Pisces, on the other hand, brings stability and emotional expression to this team. Creativity flows wonderfully when a Pisces is on the job, enhancing the Aries' approach to reaching goals.\n\nChallenges may occur when the Pisces feels stuck or stagnant, and seems unwilling to explore the possibilities of change. Further, if the Aries seems overpowering, there can be conflict. Be sure to hear one another out and to show respect for differences.",
		"friendship": "Forthright Aries and reserved Pisces form an unlikely friendship. Although the Ram is bold and outgoing and the Fish is shy and reclusive, they do have some things in common. Both are highly sensitive to criticism. Aries tends to lash out when hurt, while Pisces usually turns silent. Neither is a stranger to pain. By bolstering each other's egos, these two can be a strong support system. Aries encourages Pisces to develop their creative talent, while Pisces assures Aries their innovative instincts are right on target.",
		"love": "Pisces has a fleeting and almost solitary spirit which may provoke the Aries authoritarian tendencies, and the two signs do not soothe each other. Pisces readily submits to domination, since he or she is awash in an inner world where reality has little effect. The vitality of Aries provides needed security. The couple will function if the Ram surrounds the Pisces with constant affection. If not, the Fish will spawn elsewhere, without even turning around for a final farewell."
	},
	"12_2": {
		"career": "The abilities and talents of each individual will bring a wonderful balance to this partnership. The Taurus is hard working, loves to do hands-on work, and is practical in most respects. The Pisces, quite differently, has a very strong imagination, intuition, and artistic character. One of the best ways for this team to work is for the Pisces to do the planning, envisioning, and creative thinking, and for the Taurus to do the nitty-gritty work.\n\nIt can be challenging for this unique pair to find a working rhythm together. Each will have to come to terms with their differences. For example, the Pisces may procrastinate whereas the Taurus is persistent. Careful planning and regular check-ins can be especially helpful.",
		"friendship": "Factual Taurus may not seem to have much in common with fantastic Pisces at first glance. After scratching each other's surfaces, though, they'll find a great deal in common. Both love beauty, art, and harmony. Each is laid-back and agreeable. Taurus delights in making Pisces laugh, while Pisces enjoys getting Taurus to loosen up. The Bull won't appreciate Pisces's forgetful ways, while the Fish will shake their head at Taurus's material concerns. Fortunately, both signs are very tolerant and will refrain from scolding each other.",
		"love": "They get along perfectly! The poetic, sensitive Fish seeks ways to make the Taurean happy, in exchange for the tenderness and security he needs. They enjoy going out together as well as the intimacy of their home. Their physical love is alchemical, spiritual, and intense. The Bull's practical side helps the Pisces to accomplish the projects bubbling up in his or her imagination; a quality which the stolid Taurus needs to lighten his sometimes monotonous life. The outlook for love is promising."
	},
	"12_3": {
		"career": "The fun-loving side of the airy Gemini mixes well with the pleasure-seeking Pisces. Not only that, but the Gemini's innate joy of talking aligns perfectly with the Pisces' love of listening. This is a combination that will truly enjoy each other's company while, at the same time, get the work done. The Piscean gains from the practical, determined character of the Gemini. This can prevent procrastination in this team. Further, the easy-going flow of the Pisces helps the Gemini to remain versatile and flexible. Intellectual work is often best suited to this pair.\n\nThe Piscean can become confused easily at times, especially when the pressure is on to wrap a project up. While this isn't something a Gemini finds especially challenging, it can be irritating for the air sign to deal with. On the other hand, when the Gemini is ultra serious and focused, the Pisces can become uncomfortable. Time to adjust, regroup, and accept is necessary for this flexible pair.",
		"friendship": "Gemini and Pisces are two totally different people who have lots to teach each other. Gemini is great at shaking off disappointment and finding fresh opportunities. Pisces is adept at forming meaningful relationships that last a lifetime. If the Twins can endure Pisces's emotional rollercoaster and the Fish can put up with Gemini's neuroses, these two can be good friends. Gemini is impressed with Pisces's creative talent, while Pisces thinks Gemini is as smart as a whip. They're both versatile and can make allowances for each other's shortcomings.",
		"love": "Pisces swims through deep waters, while the Gemini inhabits the airs. One is a contemplative, solitary being, while the other enjoys discussions. Pisces seeks absolute love and emotional intensity; if the Gemini can stretch his or her imagination to attain the emotional commitment which is alien to him or her, the couple will experience an extraordinary spiritual union. They share a taste for freedom: the Fish to explore his imaginary world, while the Gemini craves a chance to display charisma in the outer world. They may embark on a long journey, or bid each other farewell before casting off."
	},
	"12_4": {
		"career": "The compassion of the Cancer blended with the sympathetic nature of the Pisces makes this duo outstanding for work that involves counseling or charity. Two water signs will naturally flow well together, bringing an easy-going and friendly atmosphere to most any environment. Just to be around this pair will feel soothing and calming. Both value relationships above all else, from people to animals. Work that involves the care of others is also well suited for this couple.\n\nChallenges will arise for both the Cancer and the Pisces when placed in a working role that requires more intellect than serving others. This can create melancholy that is damaging to working projects. Further, it can be tough for this pair to lift one another's spirits when both are feeling down.",
		"friendship": "Cancer and Pisces are great pals. Loving Cancer enjoys lavishing insecure Pisces with affection. The expressive Fish adores drawing the Crab out of its shell. There will be times when Cancer gets exasperated with Pisces's irresponsible behavior with money. Pisces, on the other hand, will roll their eyes at Cancer's career obsessions. For the most part, they'll overlook each other's weaknesses. They're both very artistic and may enjoy collaborating on creative projects together. These friends are a terrific support system for one another.",
		"love": "When these two Water signs flow together, the Moon soon locks into Neptune's orbit. Cancer and Pisces intuitively understand each other; they handle each other's sensitivity with respect, care, and gentleness. Their personalities are likely to merge. In physical love, they give of their souls for mutual delight. Loathing power struggles, they silently respect each other's solitude, and barely need to speak aloud. Pragmatic Cancer can relieve dreamy Pisces of life's daily tasks. If the latter is willing to settle down, total harmony is in store for them."
	},
	"12_5": {
		"career": "When a fire sign comes together with a water sign, the resulting effect is pure steam. Both blend to create a transformation of one another. Such is usually the case with a Leo and a Pisces. The shared love of artistic expression creates a common ground for this pair to build upon. When facing a project that requires endurance, and even sacrifice, this couple won't shy away. The Leo brings generosity, while the Pisces gives rhythm.\n\nChallenges may arise if the Leo is too authoritative with the Pisces. Further, each person is likely to require a strong sense of purpose with his or her work. Each thrives on being truly inspired by what they do. Therefore, projects that do not speak to this creative pair will take a long time to get done.",
		"friendship": "Leo and Pisces form an unusual alliance. Outgoing Leo is mystified by the Fish's reclusive ways. Introverted Pisces will tire of the Lion's self-centered stories. However, all is not lost on the friendship front. Both signs have a deep appreciation for fantasy and glamour. They'll find they share lots of the same taste in movies. They'll admire each other's fashion sense. Above all, they'll connect over their mutual desire to transcend mundane reality. If Leo can put up with Pisces's tearful outbursts, Pisces will tolerate the Lion's gargantuan ego.",
		"love": "Both thrill to the feeling of unconditional love, and their secret sexual garden will bear delicious fruit. However, the Pisces, unconcerned with material things, will treat the Lion's gifts lightly. The regal lifestyle and authoritarian character will arouse resistance. The Piscean will not submit; instead, he or she will retreat into an inner world, indifferent to the crashing surf above. The Leo, left alone, will be profoundly wounded. Yet if the Pisces remains by the Leo's side, it will be a sign that he or she is finding true emotional fulfillment. And vice-versa."
	},
	"12_6": {
		"career": "Astrologically, the Virgo and the Pisces are a polarity - they are opposites in the zodiac. The key phrase for the Virgo is \"I analyze,\" while the Pisces' is \"I believe.\" Although these two are considerably different in perspective and approach, each can offer strength to the other. The Pisces lends the power of intuitiveness and dreams to the traditionally \"seeing-is-believing\" Virgo, enabling each to consider more options and possibilities. The Virgo brings a strong work ethic and dedication to practicality that can encourage the Pisces to be more responsible in their decision-making. Work that involves creativity in the finer details is apt to go over well.\n\nDifferences can also bring challenge to the team of Pisces and Virgo. Each of these signs can be intolerant and impatient toward each other. Time is the only means to beat this tendency, as neither person can be rushed to like the other one.",
		"friendship": "Practical Virgo has difficulty relating to dreamy Pisces. These two signs are opposites in many ways, but this doesn't mean they can't be friends. Virgo has tremendous intellectual gifts but is sometimes shy about sharing them. Supportive Pisces will help find an audience for Virgo's scientific, social, and creative work. Naïve Pisces has difficulty spotting manipulators, which is where discerning Virgo can be a tremendous help. Both are service-oriented signs that may enjoy doing volunteer work, especially if it involves rescuing animals or other innocent creatures.",
		"love": "Piscean imagination and poetry provide needed relief to Virgoan common sense, broadening horizons which would otherwise become monotonous. These two individuals share an open-mindedness which would promote discovery, and they may find a way to be happy together. The Piscean can sense the Virgo's desires intuitively, which is ideal for their sex life. If the Virgoan respects the Fish's mysterious inner depths, he or she will derive great rewards from Pisces. A sense of love is one of the gifts both individuals possess."
	},
	"12_7": {
		"career": "With the Libran's love of social interaction and partnership, along with the Piscean's desire for laughter and fun, this is a team that's sure to make any work project seem like a veritable party. Regardless of what the task is, chances are music will jingle along with the productivity, and plenty of chatter will be heard as well. This is a great team, and one that can accomplish a great deal of work amidst the singing and chitchat.\n\nThere are not apt to be a lot of difficulties or challenges with this couple. Both people will, however, feel terribly restricted should the working environment prohibit a relaxed, fun approach. This can put a real damper on spirit and positive productivity.",
		"friendship": "Libra and Pisces have radically different guides to life. Libra is led by their intellect, while Pisces operates on intuition. If these two signs turn to each other for help, they will form a formidable friendship. Libra will discourage Pisces from falling victim to irrational fears, insisting the Fish get the facts before making wild assumptions. Pisces will help Libra see that there is more to life than meets the eye. Both have a deep appreciation for art and a dislike of confrontation. This is a pleasant alliance.",
		"love": "A shared delight in culture, art, and literature gives this Air/Water duo a definite mutual attraction. But the gap between them may soon grow difficult to bridge with understanding. Each must be alert to this fact. A Piscean needs regular doses of solitude, whereas the Libran cannot thrive without the admiration of others. If each respects this basic difference, the Libran can bring the Pisces a pragmatism alien to the latter's abstract world. In exchange, the Pisces provides a glimpse of his or her rich imagination - as long as the partner does not probe too insistently."
	},
	"12_8": {
		"career": "A common preference for an easy flowing atmosphere, with no chaos swirling about, is prized in this working combination. Both being water signs, the Scorpio and the Pisces can become rattled and confused when too much is going on directly around them. In this regard, they understand each other quite well. Both are also intensely emotional. Yet, in other ways, there are significant differences that can work toward enhancing their partner's qualities. The Scorpio has strong analytical skills, whereas the Pisces is more intuitive.\n\nThese differences can also pose challenges to this pair. A Scorpio isn't apt to feel comfortable putting any work off. Diligence is far more this person's way. Alternately, the Pisces can find the sting of the Scorpio's tongue a bit much to take at times. Each will need to exercise tolerance and patience for best results.",
		"friendship": "These two Water Signs are terrific friends. Protective Scorpio loves caring for vulnerable Pisces. The whimsical Fish enjoys lifting Scorpio's spirits. They're highly creative people who love collaborating on writing, music, and design projects. When they're not working, they have fun trading books, watching movies and going to concerts together. Scorpio sometimes complains about the Fish's lazy habits, while Pisces will turn its tail at Scorpio's nasty streak. Fortunately, they are both very sensitive and will quickly apologize for hurting each other. This is a friendship that can afford tremendous happiness.",
		"love": "Sensitive and instinctive, Scorpio and Pisces have a mutual affinity only rarely encountered in the zodiac. They may be devoted to one another body and soul; their love is erotic, all-encompassing, and often unique. A gaze speaks volumes of poetry, and intuition replaces reason. Their magical bond is immune to everything except Scorpio's jealousy. If it looms, Pisces will dart away on the first wave. He or she loathes ugly emotional confrontations, and this feeling is stronger than his or her passionate love for the Scorpio."
	},
	"12_9": {
		"career": "When a Pisces and a Sagittarian come together on a project, expect a lot of dynamic action. Both are imaginative, intuitive, creative and enthusiastic about the possibilities of what can be done. This bodes extremely well when working together on projects that are artistic in nature. Industries such as magazine production, designing and music or theater production suit this duo perfectly, where visualization and understanding are routinely needed.\n\nOne major challenge for this pair is the proclivity for both to procrastinate. This is not to say that each isn't going to complete the work before them, but rather to note that much is left to the last minute when not guarded against.",
		"friendship": "Irreverent Sagittarius enjoys the company of whimsical Pisces, albeit in small doses. Both these signs are spontaneous individuals who love acting on impulse. The Archer won't enjoy tending to the Fish's mood swings, while Pisces doesn't appreciate Sagittarius's brutal honesty. Still, these versatile creatures can have lots of fun together. If Sagittarius can adopt a milder tone, Pisces will be less maudlin. They're both quite spiritual and might attend religious services together. Collaborating on humanitarian projects can also be enjoyable for these two.",
		"love": "Intuitive and independent creatures, they have much to share. Sagittarius can help Pisces make his or her dreams reality, but the former's critical mind and frankness may wound the latter's hypersensitive nature. They don't infringe on each other's freedom: each needs something different, and they respect the boundaries at home. But if one partner must submit to the other, it will be the Pisces, who is given to sacrifice. True, the same Pisces, who craves infinite love, may suffer from the Sagittarian lack of passion."
	},
	"10_12": {
		"career": "Even though the practical, responsible Capricorn is generally the opposite of the emotional, introspective Pisces, the combination of talents can create a winning team. A Pisces is receptive to ideas - even those that seem far-fetched. They are willing to reach beyond the expected. Uniting this with the Capricorn's keen sense of caution and responsibility gets the work done with flair. This partnership can enhance one another's talents a great deal by encouraging each person to tap into the lesser-used parts of their abilities.\n\nPisces is an emotional sign. Capricorn is not. This can lead to challenges in levels of compassion and patience along the way. The best way to work around this major difference in attitude is to take a break from one another when the atmosphere gets intense.",
		"friendship": "These two signs make excellent friends. Sensible Capricorn helps impractical Pisces become more responsible. Whimsical Pisces encourages the predictable Goat to take a few risks. Capricorn is touched by the Fish's thoughtful gestures and can thrive from their tender loving care. Pisces is comforted by the Goat's strength and stability, knowing their friend will always help in emergencies. Of course, Capricorn will be impatient with Pisces' tendency to cry at sappy commercials, while Pisces will disapprove of the Goat's workaholic ways. These friends really do adore each other, though.",
		"love": "The profound Pisces sensitivity gravitates toward a solid Capricorn mooring, a reassuring and respectable person. But the total absence of materialism characteristic of the Pisces irritates the Capricorn, who knows what things are worth after having earned them through hard work. Discussion is difficult, due to the Capricorn's rock-hard realism. The Pisces floats in a spiritual, emotional, poetic medium. However, often the latter's pliancy makes it possible for him or her to submit to Capricorn's direction."
	},
	"11_12": {
		"career": "This team has the incredible capacity to handle work that has a profound impact on others. Projects that aim to improve situations and strive for the betterment of humanity are greatly suited to an Aquarian and Piscean team. Each possesses imagination, creativity, and drive. Not only can they envision the results of their concerted effort, they can do everything needed to make their ideas a reality.\n\nChallenges can occur for this combination when there is a lack of focus or direction with the work itself. It's best when things are laid out clearly right from the start. Both can become frustrated easily when they are creatively limited in what they can do with any project.",
		"friendship": "Aquarius and Pisces form a rewarding, if uneasy, friendship. The intellectual Water Bearer is indifferent to sentimentality, whereas emotional Pisces is immune to logic. Aquarius will get frustrated by the Fish's refusal to face facts, while Pisces will dislike the Water Bearer's inability to recognize social cues. Still, these two have quite a bit in common. Neither is particularly materialistic, so they can have a great time whether they're flush with money or totally broke. They also share a powerful desire for social justice and enjoy working together on humanitarian efforts.",
		"love": "Both signs are attracted to the arts, philosophy, and culture, so they share many ideals. But the Pisces finds the Aquarian lacking in emotion; he or she defines love as an intense experience. The Fish will soon go elsewhere in search of emotional bait. However, if the Aquarian manages to work up a little warmth and tenderness, the couple can evolve towards great intellectual and imaginative accomplishments. It's a matter of balance and availability. Pisces demands little time, which is perfect for the busy Aquarian. But if Pisces is denied affection, he or she will take off in search of it."
	},
	"12_12": {
		"career": "This dreamy, imaginative pair is sure to have the music playing when on the job. In fact, they might even be seen making their own! A Pisces character is one that thrives on rhythm and rhyme. Both people will be compassionate, sacrificing, and charitable, making this pair ideal for any work related to the arts. This team is quick at learning, and can enhance his or her skill set fairly easy, allowing for advancement. Together, they are apt to suit creative work like no other team.\n\nOn the challenging side, it's wise not to expect this couple to meet strict deadlines. One Pisces will procrastinate - let alone two! Further, it is also a part of this personality to become easily confused; therefore, a flexible time allotment is essential for this couple to do their best.",
		"friendship": "Two Pisces form a mutual admiration society. These friends enjoy each other's refusal to put pressure on one another. When their schedules are free and they can come together in a spirit of harmony, it's great. They enjoy art, music, and spiritual pursuits. These two also have a profound love of the sea that will send them on many waterfront trips together. Of course, neither can depend on the other to deliver hard truths. Pisces are terrified of confrontation and would rather let sleeping dogs lie.",
		"love": "A boundless ocean of feeling and spirit hosts the emotional and physical exchanges of two Pisces individuals. They mirror each other's personalities, attracting each other, merging at every depth, intuitively understanding each other. Each senses the other's flow, without interfering. Respect for individuality rules. Their daily life may be somewhat erratic and unrealistic, but if they are artists, they will evolve together in a world of emotion, tenderness, and philanthropy. Their sexuality will be sublime, as each seeks to please the other. Exquisite devotion..."
	},
	"1_11": {
		"career": "Sparks are apt to fly when an Aquarius' eccentricity feeds an Aries's fire. Great work is apt to be the result of these combined energies, as both are go-getters. The Aquarius brings higher thinking, imagination, and a willingness to reach beyond the ordinary, while the Aries lends conviction, leadership, and motivation to this team. By giving each other the time to do what they do best through patience and a willingness to hear one another out, the results are nothing less than spectacular.\n\nThe single challenge this team can face lies in getting the work completed. Short projects are best suited, as each needs a constant stream of new stimulation to remain motivated.",
		"friendship": "Pioneering Aries and unique Aquarius have lots in common. Both have a deep appreciation for unorthodox ideas and new methods. These trailblazers make fast friends. Aries is a lot more excitable than steadfast Aquarius. Aquarius is much more stubborn than active Aries. At times, these two will argue about money, romantic relationships, and work. So long as they don't try to control each other, these spats will be quick and painless. Neither should attempt strong-arm tactics. Both signs cherish their independence and resent being told what to do.",
		"love": "Two forward-looking individuals who instinctively understand each other and share a vision of the future, as long as the freedom of each is respected. Aquarius is immune to the Ram's domineering spirit. But the Air sign's detachment may frustrate the Aries need for passion. If a common interest favors friendship over love and the Ram is satisfied with a dispassionate relationship, while Aquarius gains by the ardent contact with an Aries, the relationship they build will be healthy, fresh, and beneficial."
	},
	"11_2": {
		"career": "The result this team produces is sure to be interesting and imaginative. When a Taurus is on the scene, you can expect productivity to be high. This earth sign has no qualms about sinking their teeth into a project and doing whatever it takes to finish the job. The Aquarius, however, is quite different. Imagination, creativity, and liveliness are part of the Aquarius' being. While the Taurus brings a hands-on approach to the partnership, the Aquarius brings motivation and ideas. When channeled toward a single goal, this can be a very powerful team.\n\nChallenges can occur when this pair isn't willing to recognize the equal value of the other person and what they contribute to the work. The best situation involves the Taurus doing a little brainstorming with the Aquarius from time to time, and in return, the Aquarius can handle some of the nitty-gritty work.",
		"friendship": "Taurus and Aquarius don't have much in common, but they do have a shared love of security. Each sign respects the other's ability to see projects through to the end and stand by their loved ones. Although Taurus loves creature comforts and Aquarius hates being tied down by possessions, they do like to get good value for their money. Neither buys into the throwaway culture of modern life. Taurus will roll their eyes at Aquarius's offbeat tastes and Aquarius will call Taurus narrow-minded, but they're too laid-back to fight.",
		"love": "Love at first sight is probable, but can it ripen into a lasting love affair? Aquarius has an appetite for freedom and a gaze firmly turned toward the future. The possessive Taurean derives his or her pleasures from immutable values like the land, the family, and the past. If the present brings them together, they rarely evolve in the same direction together, and each will tend to stick to his own character. Soon the Bull feels misunderstood, while the Aquarian dreams of new horizons... But love makes anything possible!"
	},
	"11_3": {
		"career": "For work projects requiring a different, even radical approach, this is one team that can handle it. The Aquarian is known for his or her ability to see and imagine in completely unique ways. Oftentimes, the new and unusual can be accredited to this imaginative air sign. While the Gemini is not considered to be the revolutionist an Aquarian often is, the dual nature of this twin sign makes their approach different than others. Further, the Gemini is incredibly talented when communicating. The Aquarius dreams the cutting-edge idea, and the Gemini communicates it clearly to others - a wonderful combination for innovative work.\n\nBoth of these signs can find themselves moody at times, and when working together, this can create a challenge or two. Time apart for a break, and good open communication are the keys to sorting problems out.",
		"friendship": "These two signs have an instant affinity for each other. Curious Gemini loves hearing about Aquarius's latest theories. Aloof Aquarius admires Gemini's ability to make friends with people from all walks of life. These two love attending parties together, separating once they arrive and then coming together to exchange notes afterward. At times, the Twins will groan about the Water Bearer's stubborn attitude. At others, Aquarius will sigh impatiently over Gemini's inability to follow through with promises. In the end, they'll set these criticisms aside and enjoy each other's company.",
		"love": "The Aquarian ability to devote body and soul to the cause of justice attracts the respect and love of the Gemini, who will vie to conquer this rare love. Once the two Air signs are united, they will merge into a shared pleasure in action, excitement, and rebellion against stuffy conventions. Together, they believe life gives them the right to freedom and independence. Nothing stops or separates them. Friends as well as lovers, they will unite their souls in making their life into a masterpiece, a great and exciting adventure."
	},
	"11_4": {
		"career": "This effervescent combination of energies creates a terrific environment for breathing new life into stale work projects. Whatever the task may be - from inventory counting to marketing strategy - a Cancer and an Aquarian are sure to get the job done, and have fun in the process. With the tenacity of the water sign, and the progressiveness of the air, bubbles are sure to form.\n\nChallenges may occur in the event that there are emotional issues afoot for the Cancer or the Aquarius. As unique as each person is, taking a lunch break together to talk can make all the difference. This couple also has the potential to nurture growth in one another.",
		"friendship": "Cancer and Aquarius are a pair of odd ducks. The Moon Child has an offbeat sense of humor, while the Water Bearer has an unorthodox view of life. They might view each other as weirdoes, which is often the launching pad to their friendship. The Crab will help the Water Bearer let down their defenses, while Aquarius will help the Moon Child be less self-conscious. At times, Cancer will get grouchy with Aquarius' aloof attitude, while Aquarius will despair over the Moon Child's obsession with money. Mostly, they'll shrug off these differences.",
		"love": "The Aquarian's chilly rationality upsets the sentimental moonchild, who craves intense emotion. These two signs are so alien to one another their relationship practically develops an allergic rash on contact. Aquarius values reality; Cancer trusts only intuition. Soon misunderstanding has settled in, widening the gap in the couple. In this struggle, the broken heart is always that of the moonchild. Be forewarned and proceed at your own risk: the stars frown on any union of these two signs."
	},
	"11_5": {
		"career": "These two signs are astrologically opposite creating an atmosphere of dynamic challenge, yet potential growth and development. The fiery Leo, bold and attention loving, is regarded as the sign of personal pleasure and creativity. Further, the Lion's key phrase is \"I will.\" Hopes and ideals are associated with the airy Aquarian, with an \"I know\" phrase attached. While the innovative and sometimes revolutionary Aquarius loves to reach for the stars of possibility, the gregarious and often dramatic Leo loves to burn as bright as the stars.\n\nThe Leo can learn much about expanding his or her thinking and to consider new possibilities. This is what the Aquarian can ideally bring to the team. On the flip side, the more independent Water Bearer gains from the exposure of the outgoing nature of the Leo.",
		"friendship": "The differences between Leo and Aquarius are epic. Leo demands a starring role, while Aquarius prefers being part of a supporting cast. The Lion loves luxury, while the Water Bearer is indifferent to creature comforts. Leo loves physical pleasure, while Aquarius occupies the realm of ideas. Still, these two can be great friends. The Lion will help Aquarius get in touch with their emotions, while the Water Bearer will make Leo aware of their place in the social network. They also appreciate each other's ability to create security and stability.",
		"love": "The individualistic Aquarian baffles the fiery Leo. The former is fascinated by the future and innovation, whereas the latter will go to great lengths to adopt whatever trend currently prevails. Once they accept their differences, the couple can function as a two-part device. However, their definitions of love are radically opposed: the Lion needs generous helpings of romanticism and sentiment, while the Aquarian rarely acknowledges his emotional side. He or she will think, act, and experiment, but always from a distance, without sentimental commitment."
	},
	"11_6": {
		"career": "An earth sign such as Virgo tends to naturally ground air energy. This serves this working couple quite well, as the Aquarian's ideas and visions can be grounded by Virgo's concrete ways. The Virgo can do the work that is required to take the ingenious, inventive Aquarian's thoughts and make them real - something you can hold in your hand. The caring, nurturing energy of the Virgo brings much calm and assurance, while the Aquarian lends a sense of adventure and daring. This is a great combination for projects that involve creation and invention.\n\nChallenges can arise as the Aquarius person may find the Virgo limiting in thought and action. Perfectionism can also be a deterrent for this airy sign. On the flip side, practicality is akin to a Virgo, and when it appears that an idea is just too far-fetched, a bit of turmoil between the two can erupt.",
		"friendship": "Although Virgo is extremely practical while the Water Bearer is an unapologetic visionary, they can find common ground. Both appreciate cutting-edge technology that's aimed at making the world a better place. They'll learn to consult each other whenever they need to buy a new gadget, car, or computer. Health is also something of a preoccupation for these signs. The Virgin will enjoy perfecting nutritious recipes for Aquarius, while the Water Bearer will have a list of great holistic therapies for Virgo to try. They form a great support system.",
		"love": "The only turf these two signs can share is the intellectual one. The traditional, methodical Virgo panics in the absence of familiarity and routine; the Aquarius devotes himself to overturning the routine and modernizing the world. Likewise, in the emotional realm, Virgo seeks certainty while Aquarius craves the unpredictable. The Aquarian chill bothers the devoted Virgoan, who may reproach him or herself for some inner failing. However, love makes all things possible... But this couple will be a challenge for both partners to tackle."
	},
	"11_7": {
		"career": "The possibilities inherent in a Libra and Aquarius team are endless. The potential to achieve tremendous success and influence others is vast when working together. Both are dreamers, visionaries, and creative people. Further, the combination of these workers' shared love of justice, altruism, peace, and reformation puts them in the ideal position to manifest change. When these air signs are set to revamping or recreation tasks, good things happen.\n\nStaying grounded is a common challenge for an air sign duo. Both persons will need to remind one another of the structures present in the working environment. If they put their heads together, they are sure to come up with ways to work around the boundaries.",
		"friendship": "Libra and Aquarius get along swimmingly, especially if Aquarius lets Libra take the lead. Although the Water Bearer is the visionary of the two, Libra is a natural executive. When allowed to set the pace of their friendship, Libra can bring great things to Aquarius's life. Finding commercial and social uses for Aquarius's brilliant ideas will give Libra a thrill. Meanwhile, Aquarius will show Libra the difference between glitter and gold. Occasionally, Libra will complain about the Water Bearer's stubborn ways, while Aquarius will disapprove of Libra's tendency to cling. No biggie.",
		"love": "When this partnership functions, it thrives as a friendship if not as a passion, growing every day. Both individuals are extroverts who value a busy social life, frequent encounters, and intellectual debate. The Libran looks back with satisfaction on the ground already covered while the Aquarian's gaze is riveted on the future. However, the Venusian will have to be patient, because Aquarius is often chilly and fearful of commitment. His or her freedom is too precious; the outer world seems to offer more entertainment than intimacy. But it is worth a try!"
	},
	"11_8": {
		"career": "The independent, scientific qualities of the Aquarian are sure to blend well with the Scorpio's investigative nature. This working team has a healthy blend of like-minded attributes and complementary differences, making their combined energies agreeable. The Scorpio can encourage the Aquarian to develop a stronger sense of purpose while the air sign can bring more humane endeavors into focus. Each person works well alone and with each other, and each possesses a high level of tolerance for the uniqueness of others.\n\nWork that has this team creating, researching, and serving others is ideal. While there aren't likely to be any significant challenges between each other, conditions that are restrictive or confining won't bode well for either the Scorpio or the Aquarius.",
		"friendship": "Scorpio and Aquarius first come together thinking they will change one another. After they get to know each other, these signs realize that neither will budge. Scorpio's willpower is a force of nature, while Aquarius has convictions that are deeply rooted. Fortunately, this inability to be influenced is a source of admiration. Scorpio respects how the Water Bearer marches to the beat of their own drummer. Aquarius enjoys how the Scorpion keeps them guessing. Together, they form an unusual friendship that makes onlookers scratch their heads with confusion.",
		"love": "The Aquarian flees emotional commitment, whereas the Scorpio swears by it, baffled by his or her partner's detachment. Aquarius defines him or herself as the freest of spirits; Scorpio sees love as possession, body and soul. However, as long as Plutonian jealousy is not aroused, this pair can build a mutually satisfying relationship. They respect each other and share a longing for extraordinary experiences. When the tension mounts, each can take refuge in his or her own world until it dissipates. Intuition and cleverness help this couple survive."
	},
	"11_9": {
		"career": "This dynamic team can bring tremendous creativity to the scene. Both the Sagittarian and the Aquarian possess strong artistic qualities and, along with this, they each have individualism, independence, and the confidence to speak up. Thinking outside the box comes naturally to each of them, making this working team excellent for brainstorming new and innovative ways for most any situation or project.\n\nChallenges can occur if one or the other person goes off alone too far or too often. It can take some time for this pair to adjust to working collaboratively. Independence can be both the greatest asset and greatest hurdle for this relationship.",
		"friendship": "These friends feed each other's energy. Optimistic Sagittarius loves Aquarius's \"anything is possible\" attitude toward life. The humanitarian Water Bearer respects Sagittarian's love of justice. They're off-beat characters who enjoy causing a commotion. Of course, they can rub each other the wrong way from time to time. The Archer doesn't like it when Aquarius gets self-righteous. The dedicated Water Bearer can't stand it when Sagittarius is unreliable. Fortunately, they know how to quarrel without inflicting serious damage. These convivial friends will have a lifetime of fun together.",
		"love": "Two adventurous, intellectual signs which share many an affinity. The Aquarian Air fans Sagittarian Fire. They may become active politically, or to save the environment; they discuss philosophy and human rights, and meet a wide variety of people. They never run out of ideas or causes. As for love, they respect, entertain, and enjoy each other. But neither has a taste for torrid passion. They prefer freedom to commitment. Oddly, though, often couples which promise each other nothing stay together the longest."
	},
	"10_11": {
		"career": "This partnership brings life to the saying \"opposites attract.\" The Capricorn and the Aquarius are considerably different in methodology and attitude. Yet, with a single focus on a work endeavor, they can be complementary. The Aquarius has imaginative abilities that are outstanding. Further, this sign thinks outside traditional boundaries, something a Capricorn isn't known for. The Capricorn will find that he or she has choices and opportunities they hadn't considered when brainstorming with this air sign. The Aquarian gains a sense of determination, discipline and traditional thinking from the Capricorn - areas that are not typically strong for this worker.\n\nWhen this unconventional couple works together, challenges are rare - providing each person sees what the other has to offer as a positive. If intolerance is present, the work will suffer as a result.",
		"friendship": "Capricorn and Aquarius seem to be a study in contrasts. Capricorn has a great respect for tradition, while Aquarius is determined to break new ground. The Goat is firmly grounded in reality, while the Water Bearer prefers the world of imagination. Still, they do have similarities. Both are determined to build things of lasting value. Capricorn can show Aquarius how to make resources stretch to the breaking point, while the Water Bearer will demonstrate the value of an extensive social network. This is a blend of energies that is challenging but rewarding.",
		"love": "Can love bring together two signs which seem to be fundamentally opposed? No doubt, but only for a brief moment until each wakes from a dream of harmony. Career-oriented Capricorn will sacrifice anything to scale the peaks. Imaginative Aquarius thinks only of improving the future of the world and humanity. The former is pragmatic and conservative, whereas the latter is idealistic and rebellious. Capricorn needs a tender, devoted helpmate, and an Aquarian is never home, preferring discussions with buddies to domestic bliss. What more is there to say?"
	},
	"11_11": {
		"career": "Teaming one Aquarian with another sets the stage for incredible possibilities. Not only are both hardworking and dedicated to doing the job at hand, each person brings the capacity to think outside the box - way outside the box. If a project requires eccentricity, this is the often the best team to pull it off. Tackling work that is considered too far-fetched or impossible to attain brings out the best in each person.\n\nChallenges can occur when one or both Aquarians do not feel appreciated or credited for the ideas they generate or for work they produce. If each person in this team takes the time to compliment and encourage one another regularly, things will go smoothly.",
		"friendship": "Sociable Aquarius is happiest when paired with another Water Bearer. These two know how to bring out the best in each other. Whether they're talking about social reform or technological innovations or conspiracy theories, they have a great time. The one drawback to this friendship is stubborn behavior. When these friends are at odds, a stalemate occurs. It's incredibly difficult for Fixed Signs to compromise, especially with one another. If these two can loosen up and occasionally defer to each other, they'll enjoy a long-lasting friendship.",
		"love": "Soaring together in the jetstream, Aquarius couples fly headlong into the future, improvising day by day. Their high-tech universe is cold and dynamic. Mutual toleration and love for freedom protects them from conflict. They defend causes with an open-mindedness they never outgrow; committing themselves to humanity and attending meetings and rallies. Friends rather than lovers, they attach little importance to sex, and see many other ways of expressing love. Harmony rules over all their activities, which are considerable. A winning team."
	},
	"1_10": {
		"career": "Putting this team on any task is a sure-fire way to get the job done, and done well. The Capricorn is a hands-on worker, who's never afraid to go above and beyond to get the job done to the very best of their ability. Getting their hands dirty only makes the task more stimulating for this earth personality. Putting this together with the energetic and competitive Aries almost guarantees a high volume of work. The Aries will set the stage, while the Capricorn builds it.\n\nChallenges can happen for this combination of signs if the Aries acts superior towards or rushes the Capricorn. The Capricorn needs to watch their stubbornness as this can impede progress as well.",
		"friendship": "Youthful Aries and seasoned Capricorn form an odd friendship. While Aries is always looking forward, Capricorn prefers to look back. If each puts forth some effort, they can meet in the present. Both these signs are remarkable leaders and will enjoy building things of lasting value. Aries is great at knocking on doors and launching sales initiatives. Capricorn is proficient at creating long-term financial security. Together, these friends can reach great heights. The key is for these two to always be working on a challenging project.",
		"love": "Can a fiery rebel and a practical Earth sign ever reach an understanding? They speak different languages: one held aloft by dreams while the other has his or her feet firmly on the ground. When they know how to reinforce the Ram's audacity with the Goat's constructive spirit, they can accomplish great things. Capricorn is slow to be tamed and won over, a process which Aries tends to interrupt early if he or she does not control his or her impulsiveness. However, if Capricorn's love is allowed to ripen, the other can luxuriate in it forever."
	},
	"10_2": {
		"career": "This is a fantastic team for getting down to work. The Capricorn and the Taurus have plenty in common. Both of these earth signs won't hesitate to dive into the mess of what needs to be handled. Hard work, plenty of sweat, or long hours won't dissuade this team. The one significant difference however, is the Capricorn's love of interaction. Often the Taurus prefers to work away from all distractions, whereas the Capricorn enjoys salesmanship and brainstorming with colleagues from time to time.\n\nThe best way to prevent unnecessary challenges is for the Capricorn to respect their partner's need for some amount of isolation when knuckling down. Sales or interactions that the Capricorn engages in are best done away from the main work area.",
		"friendship": "Taurus and Capricorn make fast friends, reveling in each other's dependability. Taurus can count on Capricorn to show up on time to every meeting. Capricorn knows Taurus will pay back a loan or return borrowed items. Best of all, both these signs share a profound appreciation for the great outdoors. Hanging out in forests, gardens, and parks is lots of fun for these nature lovers. Each delights in the other's sense of humor. When times get tough, they make each other laugh. These two have got each other's backs.",
		"love": "Courageous, ambitious Earth signs, Taurus and Capricorn seem to be made for each other. Both value financial success and share a love of beauty, of lasting, classical foundations. Capricorn's irony charms the Bull, while the latter's expert sensuality rescues the Capricorn from his or her natural modesty. They enjoy talking together, and communication is excellent. They confide in each other, promising never to offend or betray the other. This could be a perfect couple."
	},
	"10_3": {
		"career": "The Capricorn's nature is certain to appeal to one side of the Gemini's twin personality. While one side of the Gemini person is lively, talkative, and fun loving, the other is exacting, hardworking, dedicated, and practical. It's this \"get-down-to-business\" attitude that's sure to merge extremely well with the Capricorn on any work project. Tasks that require discipline and an analytical approach are well suited to this pair.\n\nWhile a Capricorn can have fun just as much as anyone, this is not apt to be the case so much on the work scene. Challenges will happen when these two are not in sync. Fortunately, the Gemini is quite versatile, which can buffer potential conflicts.",
		"friendship": "The Twins exude youthful energy, while the Goat is an old soul. If these two can manage to let down their defenses, they can form a helpful friendship. Gemini can bring Capricorn up to date on the latest trends. Capricorn can give Gemini an appreciation for tradition. Although the Twins will never buy into the Goat's pessimistic outlook, while Capricorn will not care for Gemini's inability to handle money, they can have fun together. Each has a terrific sense of humor. Gemini's irreverence mixes well with Capricorn's sardonic wit.",
		"love": "Initially, this would appear to be a poor match: hard-working, ambitious Capricorn clashes with Gemini's jovial, carefree spirit. But Capricorn gives mercurial Gemini some needed security, especially financially, while Gemini is a wizard at conjuring away Capricorn's worries. If love is present, Gemini's adaptability will be an asset in holding on to the Capricorn. He or she knows this is one partner who will never abandon him or her, and that really counts!"
	},
	"10_4": {
		"career": "In astrology, Cancer and Capricorn are complete opposites. The key phrase for Cancer is \"I feel,\" and it's the sign of the home. Conversely, for Capricorn the phrase is \"I use,\" and the focus is on public life. Because of this contrast, this working team has the opportunity to enhance one another and to strike a great balance. While the Cancer brings feeling to the drawing table, the Capricorn brings practicality. Both are cautious and practical.\n\nChallenges will happen when acceptance and tolerance of one another, or of the work project, is low. Time is often the best resource for this situation to improve. Allow each person the chance to adjust.",
		"friendship": "Cancer and Capricorn are complete opposites, which is the secret to their friendship. The Crab has tremendous emotional intelligence, knowing what people need to thrive. The Goat is enormously practical, understanding what needs to be done to succeed. Sometimes Cancer will accuse Capricorn of being cold-hearted. Other times Capricorn will claim Cancer is hypersensitive. For the most part, they'll be able to overlook these shortcomings for the sake of creating something of lasting value. These two are builders and balance each other beautifully.",
		"love": "A union of talents quite likely to produce harmony. Cancer is delighted to take care of the home and children while Capricorn goes out in the world to earn the family's keep. Each helps the other to fulfill an ambition, in realms that are perfectly complementary. The Saturnine personality benefits from Cancer's intuition, and the moonchild appreciates Capricorn's ability to achieve financial security. They take the time to love, understand, and cuddle each other. An ideal marriage: conventional, happy, and united for life."
	},
	"10_5": {
		"career": "While these two signs are considerably different in perspective and approach, with strong communication they can strike a balance between them and work together quite well. The Capricorn's nature brings practicality, caution, and even perfectionism to the table, while the flamboyant Leo exudes drama and creativity. Yet, the fiery Lion is also organized and willing to go the distance, which blends well. Capricorns, while ultra focused, also enjoy sharing ideas with their teammate.\n\nThe best thing for this team to do is to communicate, and communicate regularly. This will go a long way in preventing confusion and misunderstanding. Projects that require both endurance and imagination are well suited to this duo.",
		"friendship": "Although fun-loving Leo may not feel an immediate connection with reserved Capricorn, these two can form a good friendship. Both these signs place a tremendous importance on dignity. Neither would dream of making fun of each other's weak points. Both possess a marvelous sense of humor. The Lion's wit is silly, while the Goat's humor is dry, but they do make each other laugh. Of course, Leo will find Capricorn's obsession with fiscal responsibility tiresome, while the Goat will think the Lion's ego ridiculous. Still, they are loyal friends.",
		"love": "Initially, it seems an unlikely match. These two socially-oriented signs often meet at parties and social functions, but rarely cross the threshold to intimacy. Capricorn's aridity is almost unable to accommodate the Leo's gushy sentimentality and romanticism. Though the Lion enjoys Capricornian humor, the latter's independence, self-sufficiency, and smugness quickly arouse his ire. Moreover, extravagant spending is inimical to the Saturnine. If each swallows his pride, the odd couple may succeed. If not, it won't..."
	},
	"10_6": {
		"career": "Expect an outstanding level of productivity with this combination of energies! Both the Virgo and the Capricorn are rooted in the principals of hard work, ethical practice, and a hands-on approach. Whether the task is planting and weeding a garden, blacksmithing, repairing computers or building skyscrapers, this is an unstoppable team.\n\nMost times, flexibility isn't a strong suit for either of these earth personalities. A Virgo and a Capricorn are pretty much set in their way of doing things, and when the two don't jive, challenges will occur. Resolution will come when both are willing to set aside the need to be right, and to consider alternative approaches for the task at hand.",
		"friendship": "Virgo and Capricorn form a strong friendship that can last a lifetime. These two Earth Signs have a natural affinity for safety and security. They also have a profound appreciation for creature comforts. The Virgin's talent for research can help Capricorn find great bargains on everything from business attire to mountain climbing equipment to antique furniture. The Goat's executive abilities can assist Virgo in landing a high-paying job in their desired industry. These nature-lovers may also enjoy hiking, biking, and bird watching together.",
		"love": "These Earth signs share the values of hard work, social advancement, and financial security. Although their love may be somewhat arid, they are skillful at climbing the social ladder together, and sustain each other through great effort, with unfailing loyalty. The Virgoan inspires the Capricorn and diverts him or her from a too-serious world; the Capricornian soothes the Virgoan, providing for the couple's material needs and freeing the latter's wit. If a perfect match existed, this would come close."
	},
	"10_7": {
		"career": "Diplomacy and a need for balance are some of what the airy Libran brings to this team. Along with the Capricorn's strong sense of ethics and cautionary nature, this working couple is often well suited to research, investigative, policing or accounting jobs. The Libran's additional drive to ensure justice adds even more to the scene when it comes to getting to the truth. The Capricorn has a strong sense of discipline, making this an excellent combination of energies.\n\nAt times both of these signs can become overly rigid. They would do well to take a break every now and then for some light-hearted fun. This can go a long ways to keeping both individuals' perspectives on track.",
		"friendship": "Affable Libra finds stoic Capricorn confusing. Libra is outgoing and friendly. When met with the Goat's stony silences, Libra can't help but feel snubbed. After spending some time in each other's orbit, Libra will realize Capricorn isn't unkind, just discerning. At that point, tasteful Libra will feel better about befriending Capricorn. Both have high standards and will enjoy finding the best stores, restaurants, and cultural exhibits together. Lighthearted Libra doesn't appreciate Capricorn's pessimism, while the steadfast Goat will dislike Libra's fickle behavior - but this friendship can last.",
		"love": "Both value a balanced family life, interspersed with social events in which the graceful Libran attracts admiration while the ambitious Capricorn makes useful professional contacts. But the Libran is liable to be disappointed with the Capricornian concept of love. The latter is so taken up with career considerations that a partner's emotional needs are not seen as indispensable. Their love may wilt in this arid climate. Such a couple is soon disunited, with each partner inhabiting a parallel universe, light years from the other."
	},
	"10_8": {
		"career": "The combination of the Capricorn's love of humor and a Scorpio's wit will ensure the jokes are flying between this pair. Both have a tendency to lean towards sarcasm and a bit of black comedy as a means to handle stressors on the job. Along with this, these two are discerning, reliable and dedicated to getting the work done to the best of his or her ability. This is a versatile combination. Projects from construction to creativity will come together with little difficulty.\n\nAlthough not overly likely, challenges can arise if one or the other misunderstands something that is said. Clarify any comments that are made to ensure both are on the same page.",
		"friendship": "Scorpio and Capricorn have a healthy respect for each other. Perceptive Scorpio has a knack for spotting hidden opportunities. Ambitious Capricorn has a great work ethic. When they combine forces, incredible heights can be reached. At times, the Scorpion will be shocked by Capricorn's ability to be ruthless for the sake of advancement. At others, the Goat will be distressed by Scorpio's capacity to inflict pain. If they treat each other with respect, these friends will avoid trouble. Both have tremendous staying power, so this could be a lifelong alliance.",
		"love": "The Scorpio admires Capricorn's ambition and determination to reach the top. The earthly realism of the latter complements the aquatic intuition of the former. Mutual respect for a social or mystical quest unites a couple animated by a shared desire for security. Their sex life is vibrant and intense. But their power struggles may be just as passionate. And when these two clash, the sparks fly! Each is too stubborn to make the slightest compromise. If this couple avoids conflict, it can reach great heights."
	},
	"10_9": {
		"career": "This working pair will do well together when tackling projects that require creativity and imagination, plus practical building skills. The Sagittarian does well when delving into expression or artistic jobs. This sign has the ability to envision and to communicate what he or she sees as possible. The earthy, tactile Capricorn can then take ideas and turn them into products or services. The complementary energies from both tend to influence and encourage each other.\n\nAs for challenges, this couple can find that they are at a loss when it comes to understanding the other person's ways of doing the job. This is because there is a considerable difference in style and perspective. Rather than stressing about this, this duo is better to practice respect and tolerance.",
		"friendship": "Spontaneous Sagittarius dislikes slowing down for cautious Capricorn. Still, the Archer would be wise to pause and give the Goat a second look. Capricorn has the capacity to turn dreams into realities. Visionary Sagittarius loves building castles in the air, but sometimes has difficulty reaching their goals. With the help of the practical Goat, the Archer could reach heights they never dreamed possible. Similarly, Capricorn will enjoy tremendous benefits from this friendship. The optimistic Archer can chase away the Goat's apprehensions, paving the way for a happier, healthier outlook.",
		"love": "They share values like ambition, success, friendship, and intellectual discussion. But the Sagittarian is optimistic, whereas Capricorn is a pessimist. The former works because he or she must to finance travel, recreation, and leisure activities; the latter could spend his or her life at the office. Soon the Capricorn becomes irritated with Sagittarian glibness, which interferes with concentration. And the latter simply realizes he or she is bored! They may travel together for a time, for each is an independent spirit. But they don't understand each other."
	},
	"10_10": {
		"career": "Putting a Capricorn with another Capricorn on a team is one sure-fire way of getting the job done, and done well. Responsible, practical, disciplined, and hardworking, this pair will consider precisely what needs to be done, and then dive into it. Earth signs often favor jobs that are tactile in nature. Working with their hands, they make outstanding carpenters, mechanics, doctors and creators. This is the busy-bee sign of the zodiac.\n\nOften though, pessimism can creep in, causing the Capricorn to slow their pace, and lose perspective. This team can do a lot for one another by keeping each other positive-minded, especially on projects that seem to take forever. Pep each other up regularly.",
		"friendship": "Two Capricorns make a great team. These two know they can depend on each other through thick and thin. Goats are famous for going the extra mile for those they love. Although they're both very cautious, they do encourage each other to take risks. That's because every Capricorn has the gift for recognizing other people's potential. When one Goat tells another they should start a business, develop a creative project, or buy a piece of property, the second Capricorn knows it's good advice. They form a strong bond that's reassuring.",
		"love": "Both ambitious and hard-working individuals, they'll put their careers first, well ahead of their romance. Their common sense facilitates daily life and avoids idle arguments. However, their shared drive for success may sometimes be a bit dull and monotonous. In many cases, they prefer to read the newspaper in bed, instead of frolicking together. They take satisfaction in the certainty of having a loyal partner and social and financial success and security. Their relationship is long-lasting and deep, but it places few emotional demands on them."
	},
	"1_9": {
		"career": "Not only will this team blaze any trail they set upon, the energy their combined psyches emit will impact all those working around them. The Aries is a real go-getter, never shying from a new project or good solid competition. The Sagittarius thrives under demanding circumstances and brings enormous creativity to the table. Both fire signs love challenge, enjoy seeing results, and enjoy social exchanges. This team may become friends outside the work environment.\n\nAttention to detail can be a detriment to this partnership. With both signs so gung-ho, it can be easy for both to overlook important details. The Sagittarius can be better at noticing the little things, while the Aries can counter their partner's tendency towards procrastination.",
		"friendship": "Dynamic Aries and adventurous Sagittarius feel an instant affinity. Both these Fire Signs like to keep moving, partying long into the night. Aries is more interested in what is hot and new, while Sagittarius has a reverence for time-honored traditions. These different tastes can actually bolster their friendship. Aries enjoys Sagittarius's ability to make any lesson fun, while Sagittarius is amused by Aries's boundless enthusiasm. Together, these two can paint the town red. A shared love of sports could prompt meetings at the gym, playing field, or other athletic arena.",
		"love": "Two Fire signs soar with shared exaltation towards ambitious ideals and adventure. The Sagittarian's candor puts the Ram in his or her place if necessary, and communication flows readily between the two, limiting the damage from conflict. Energetic and intimate activity is part of their daily routine. These two individuals have energy to burn, and an appetite for mutual love and seduction. No clouds on the horizon as long as each accepts that the other will make no compromise..."
	},
	"2_9": {
		"career": "This team will definitely be an active and dynamic one. When the Taurus decides to take on a project, they are on the move and hard at it before you can say, \"go.\" Combining this with the Sagittarius' enthusiasm makes a great team. The Taurus brings commitment and timeliness to the fiery Sagittarius and in return receives understanding and optimism. Each is enhanced by the other. Work that requires a hands-on approach or that requires creative thinking is suited to this partnership.\n\nThe Sagittarius' tendency to procrastinate and change their mind on a moment's notice can be challenging for the Taurus to deal with. Alternately, the stubborn side of the Taurus can frustrate the Sagittarius. Patience and courtesy will alleviate most of the problems that can arise.",
		"friendship": "Stable Taurus can have a hard time connecting with adventuresome Sagittarius. The Bull loves peace and quiet, while the Archer craves excitement. Finding common ground is difficult, but it can be done. Both of these signs are straightforward. Therefore, they appreciate each other's honesty. When Taurus wants to know if they are being cheap or stubborn, Sagittarius will tell them. If Sagittarius is wondering whether they're behaving irresponsibly, Taurus will say so. This is a friendship grounded in reality checks.",
		"love": "One dwells in dreamland while the other never takes off from reality; one loves escape, travel, and change while the other doggedly takes root and slowly builds a real accomplishment. Flexible Sagittarius is more adaptable than the stubborn Bull, because he or she uses his or her powers of abstraction as an escape hatch. But each lives in a world alien to the other, and real understanding is a remote possibility. Their fundamental differences are likely to surface one day, perhaps forcefully enough to disunite them."
	},
	"3_9": {
		"career": "Directing these two energies towards work involving ingenuity and artistry is generally the best way for each to do what they do best. While these two are astrologically opposite, creativity is the one strong suit they both possess. The imaginative Gemini thrives on self-expression, while the Sagittarian considers the big picture and overall impact of what is done. Architecture or landscape design is a good example of where this combination would do fantastic.\n\nChallenge may occur if one or the other person questions the motivation or values of the other. Communication, which is another strong quality of both signs, is essential to keep work flowing smoothly.",
		"friendship": "Gemini likes fiction while Sagittarius prefers biographies. The Twins want to hear all the gory details while the Archer is only interested in the big picture. Gemini can see many sides of a given issue, while Sagittarius insists there is only one truth. Although these two signs come at life from radically different directions, they can still form a solid friendship. They both love to travel. A shared love of the written word is another bond. In addition, these two are great students. Their friendship is a miniature classroom.",
		"love": "Air and Fire are a good match. Gemini enjoys Sagittarian finesse, whereas Sagittarius is attracted to this open-minded partner. The couple is likely to lead an exciting social life, surrounded by a vast sea of friends. They'll experiment with every form of love. Conversation will thrive on talk of travel and grandiose plans, banishing boredom. The pair will radiate a fresh, youthful feeling of nonchalance, which will attract a horde of friends to share in and magnify their happiness."
	},
	"4_9": {
		"career": "An excellent balance is created when these two signs work together. The Cancer's subdued approach works wonders on the often overly excited Sagittarian. The water sign grounds the fire, keeping everything in perspective and steadily moving. The Sagittarian lends much vitality and excitement to the Cancer's environment. The dynamic nature easily encourages the Cancer to see more and to reach for greater heights. This couple brings out a lot of the other's best qualities.\n\nBoth of these signs love family; however, the Cancer is even more home-oriented. This is something the Sagittarian will need to accept. While the fire sign may want to burn overtime hours, it's not likely the water sign will be willing. Recognizing this is half the solution to any potential conflict.",
		"friendship": "Cancer and Sagittarius are a strange duo. The sensitive Crab can burst into tears at the drop of a hat, while the optimistic Archer refuses to let anyone break their stride. Cancer is great at creating a comfortable, enriching home life, while Sagittarius prefers living out of a suitcase. Although they are very different, these two signs do admire each other. Cancer respects Sagittarius' moral code, while the Archer appreciates the Moon Child's emotional honesty. They can rely on each other to be honest, fair, and ethical.",
		"love": "Water and Fire, the recluse and the globe-trotter, the lecturer and the dreamer... They live in different worlds, but love is an interstellar vessel. Cancer enjoys listening to Sagittarius describe a journey, but will never be coaxed into donning a backpack and embarking on a real adventure. Moreover, the intellectual and physical preferences of a Sagittarius may make it difficult for him or her to strike a resonant chord in a Cancer. It's worth a try, but harmony will be hard to achieve."
	},
	"5_9": {
		"career": "When two fire signs come together, you can expect their trail to be ablaze - and fast! The magnetic draw of the mighty Leo Lion burns brightly together with the Sagittarian's ability to teach in a straightforward way. This pair has the potential to create a team that can change the working environment before you know it. Not only will this duo enjoy each other's company, they will find it easy to influence and assist all those around them. Work that requires a team to organize and instruct are ideal.\n\nChallenges can arise when both fire signs - with their innate ability to lead - want to take the wheel, so to speak. This partnership must learn to share this responsibility, or to at least take turns.",
		"friendship": "Leo and Sagittarius love being together. Playful Leo delights in the Archer's irreverent humor. Energetic Sagittarius appreciates the Lion's tremendous energy. They'll have fun traveling, playing sports, and causing a commotion. Leo privately thinks Sagittarius is a bit of a flake, while the Archer bluntly asserts that the Lion is an egotist. Although these differences will cause some loud arguments, neither sign takes these spats too seriously. These friends understand that life is much nicer when they're together than when they're apart.",
		"love": "The Fire signs Leo and Sagittarius pursue the same goals, and can succeed in allying their strengths instead of competing. Optimistic, generous, and romantic, they understand and love each other with both passion and tenderness. They indulge in life's pleasures to the fullest, laughing unabashedly and egging each other on. Sagittarian criticism may sometimes hurt the Leo's feelings, but forgiveness will soon be forthcoming. The Lion is aware of his sacred complicity with the Centaur-Archer. Together, they reach the heights of bliss."
	},
	"6_9": {
		"career": "A shared passion for helping others brings commonality between this pair. In many regards the Virgo and the Sagittarian are quite different, yet when put together on a project, their individualism can blend quite well. The Virgo brings an analytical, discriminating, and meticulous style to the work environment, while the Sagittarian lends strength with a straightforward and creative approach. Combining these skills toward projects that involve caregiving or charity is an excellent plan.\n\nChallenges can erupt quickly with this pair, and being forewarned is a means to avoiding a great deal of frustration. Tolerance and respect for each individual's style and methods are imperative to keep things rolling along smoothly. The Sagittarian might note that procrastinating will probably disturb the Virgo, and on the other hand, the Virgo can consider how critical he or she comes across to the Sagittarius.",
		"friendship": "Virgo and Sagittarius are often at odds with each other. Precise Virgo is bewildered by the Archer's sweeping vision. Adventurous Sagittarius feels deflated by the Virgin's cautious approach. Before these two write each other off, they should give this friendship a try. Both are incredibly intelligent. They may be delighted to discover they love many of the same books. These two are also interested in current events and will enjoy discussing politics, culture, and social movements. Last but not least, they share a love of travel and exploration.",
		"love": "It will take work, but it can be done. The independent character of each, reserved Virgo and exuberant Sagittarius, may thwart all understanding. Confident Sagittarius strides ahead, optimistic and ambitious, whereas anxious Virgo pulls back, careful to avoid danger as much as possible. Sometimes the couple may function as a complementary unit. Thus, Virgoan tact may compensate for Sagittarian frankness, and Sagittarian enthusiasm may banish Virgoan anguish. But basic differences are difficult to overcome, and this couple often succeeds only by an implacable effort of will."
	},
	"7_9": {
		"career": "The combination of the Libran's need for justice and the Sagittarian's philosophical outlook makes this an interesting working pair indeed. Both are apt to be warmhearted and deeply concerned about those around them. Further, each brings a love of giving. This makes an ideal combination for the work environment that involves ensuring that others have what they need. Work that is charitable, advocating or humanitarian is an excellent choice to bring out the best in both.\n\nBecause both the Sagittarian and the Libra are sensitive and benevolent, each one can find their spirits crushed when others mislead them, or when they are unable to achieve the goals they set. The Sagittarian is generally the eternal optimist, and this can be challenging at times. Given a little time, this team is sure to pick themselves up, dust themselves off, and get on with the job at hand.",
		"friendship": "The friendship between Libra and Sagittarius is a strong one. Libra finds the Archer's depth and breadth of knowledge stimulating. Sagittarius admires Libra's ability to argue all sides of a given issue. Both are very smart and enjoy discussing everything from art to politics to religion. Of course, Libra isn't a big fan of the Archer's coarse humor, while Sagittarius thinks Libra is too fussy. But these differences will be a source of lighthearted teasing between them. Secretly, neither wants to change the other; they're perfectly happy as they are.",
		"love": "The meeting of two such optimistic minds should lead straight to bliss. Together, they enjoy elaborating their plans, consolidating their social prominence, and embarking on adventurous journeys. Librans lean towards marriage, but Sagittarius holds back, fearful of losing his or her independence. However, if he or she can be convinced that marriage will not crimp his or her freedom, the knot will soon be tied. The couple, surrounded by a sea of friends, will carry out shared dreams and ambitions, endowed with just enough common sense and rationality to accomplish them."
	},
	"8_9": {
		"career": "These two signs are sure to come together very well. Not only this, each will find that he or she is better for the experience of working together. The Sagittarian finds it naturally easy to understand the Scorpio's methodology. The witty, analytical energy of this water sign will appeal greatly. In many regards the Scorpio brings a sense of grounding to this fiery coworker. On the other hand, the Sagittarian can influence the Scorpio to consider his or her emotions, dreams, and experiences. The oft-philosophical Sagittarian enjoys a good debate—a stimulating experience for the Scorpio.\n\nChallenges can arise between this pair when the Sagittarian is vague or unstructured. The Archer can also procrastinate, which may really irritate the Scorpio. When too rigid or unwilling to bend, the Sagittarian can become frustrated with the Scorpio.",
		"friendship": "Scorpio and Sagittarius are very different people who have lots to bring to each other. Driven Scorpio can show the Archer how to follow through on their dreams. The optimistic Archer will assist Scorpio in dispelling doubt. Naturally, resourceful Scorpio will disapprove of Sagittarius's irreverent attitude toward money. Meanwhile, the open Archer is suspicious of the Scorpion's secrecy. Still, if they can accept each other's weaknesses, these friends will benefit from their respective strengths. Fortunately, they both have the ability to exert mind over matter, allowing them to overcome minor irritations.",
		"love": "Opposites attract, and in t his case, Scorpio's emotional depth and mystery are intrigued by Sagittarian superficiality and rationality. The Sagittarian is given to idle chatter whereas the Scorpio can spend hours plunged in silence, reading or simply reflecting. When bedtime rolls around, the Sagittarian is looking forward to slumber whereas the Scorpio is ready to uncork his torrid sensuality... Often this sort of couple breaks up soon, after a few epic battles drain the energy of each partner. Exhausting!"
	},
	"9_9": {
		"career": "Sagittarians are considered philosophical and insightful - the sign of higher thinking. This makes for excellence in teaching as well as in expression. Symbolized by the mythical Archer, the Sagittarius shares a love for people, nature, and animals. As a fire sign, you can expect the results to burn bright when this team is on the job. Working together is apt to be like two matching gloves.\n\nIt can be challenging for this couple to meet deadlines, as procrastination is akin to the Sagittarius. Further, it may be tough to resist constant conversation when together. The best way to overcome these challenges is to keep one another in check. Reminders can help a great deal!",
		"friendship": "Whenever two Sagittarians get together, a party breaks out. This fun-loving sign adores teaming up with someone who shares their festive spirit. Archers are optimistic, outgoing, and humorous. They love making people laugh and exploring unknown territory. Constant travelers, these two will fly off to far-flung places at the drop of the hat. Of course, their similarities can create problems from time to time. Sagittarius is brutally honest and has no problem issuing devastating criticism. As a result, this friendship could suffer from a total lack of diplomacy.",
		"love": "A pair of world travelers with an intellectual bent, they range far and wide in quest of spiritual or physical adventure, with an unsinkable optimism. Explorers, philosophers, athletes: they spend their life on the road and enjoy a vigorous discussion. As for the nest, or putting down roots, neither partner deems such goals worthy of attention. They'd be happy to live in a tent all their lives; often, their home is just a transfer point. They spend one night there and then set off in quest of new discoveries. But this enthusiastic and curious couple has the key to its own happiness."
	},
	"1_8": {
		"career": "The Scorpio's ability to analyze and find the most logical approach to solving a problem brings strategy to this partnership. By creating a solid foundation based on practicality, the Scorpio provides an excellent platform for the Aries to build upon. The Aries is outgoing, energetic and ambitious, and the more support this fire Sign has, the higher they can go.\n\nComplications can arise between these two. While the Aries is outgoing and gregarious, the Scorpio is quieter and observant in nature. This difference can lead to misunderstandings when they fail to communicate regularly and completely. With the Aries' quick, hot temper and the Scorpio's stinging sarcasm, situations can get out of control. A cool-down period away from each other, followed by communication will solve dilemmas in no time.",
		"friendship": "Daring Aries and passionate Scorpio form an explosive friendship. These two love getting into trouble together. Going to extremes is their idea of fun. Occasionally, the authorities might have to be called! Fortunately, Scorpio is an expert at getting out of messes. When they can't slip through the net, Aries usually can help them break free with a lot of fast talking. When they're getting along, these two can move mountains. A tendency to make mountains out of molehills will cause some heated fights, however.",
		"love": "A bond between these two Mars-ruled signs is ardent, passionate, and often stormy. No neutrality is possible, and day-to-day management of such extreme feelings may prove difficult. Scorpio's possessiveness will not tolerate the slightest unfaithfulness, but the Ram often yields fully to the Scorpion's sensuality - unless he or she is startled into scampering away... This poignant dance, in which each partner vies for control, can be fleeting or long-lasting, sublime or terrifying: there is no happy medium!"
	},
	"2_8": {
		"career": "Even though the motivation for working, striving to get ahead, and making money is considerably different for this team, they should be able to work together just fine. The Taurus and Scorpio are opposite signs in astrology. While the hard-working Taurus truly loves and desires possessions, the analytical Scorpio prefers to focus on shared acquisitions. Yet both signs are quieter by nature, work best in a peaceful environment, and will make sure the job is done well.\n\nComplications can arise if both people allow their stubborn sides to take control. Flexibility is the key to making the most of this relationship. Taking routine breaks can help create a peaceful partnership.",
		"friendship": "Taurus and Scorpio usually eye each other warily before forming a friendship. Straight-shooting Taurus is suspicious of mysterious Scorpio, while passionate Scorpio can't fathom Taurus's calm demeanor. If the two of these signs spend enough time together, they can become friends. Taurus will teach Scorpio to laugh at life's absurdity. Scorpio will help Taurus obey its sensual desires. When these two fight, it is epic. Taurus is stubborn and Scorpio never forgets a slight. They find each other so fascinating, though, that it is hard for them to stay apart.",
		"love": "There's a lot of attraction in this match between two naturally reserved, determined, and physically oriented signs, and great potential for domestic success. Both value financial prosperity and hard work. But if they don't make beautiful music together immediately, a terrible uproar is imminent. Intuitive, emotional Scorpio accumulates negative feelings until they reach critical mass. If Taurus is not ready to handle a meltdown, Scorpio's tenacity will be unbearable and even the Bull will give up. It's either heaven or hell: nothing in between."
	},
	"3_8": {
		"career": "The Gemini's ability to laugh-it-up can mix well with the more intense, serious Scorpio. Gemini can handle the changing aspects and moods with relative ease, and Scorpio will make sure the job is penetrated and done correctly. This working couple can be seen chuckling together while pouring over the books - depending on what needs to be tackled. They make a great team.\n\nChallenges can occur when emotions are prominent on the work scene. Both the reactive Gemini and the volatile Scorpio can find that their feelings occasionally get the best of them. When this happens, it can seem impossible to focus on the work. Talking openly can sooth feelings, making it easier to get back to work.",
		"friendship": "Gemini and Scorpio each have their own ideas about how life should be conducted. Neither can be easily converted. That's why it can be difficult for these signs to form a friendship. When they do, it's usually because they appreciate each other's incisive thinking. Gemini is extremely well informed and can support their arguments with compelling facts and figures. Scorpio isn't afraid to shatter taboos and challenge limiting attitudes. Independent Gemini finds Scorpio's jealousy distasteful, while passionate Scorpio can't comprehend Gemini's composure. They do appreciate each other's keen intellects.",
		"love": "What a contrast! Airy Gemini and mysterious Scorpio are bound to be an eccentric pair, delighting in their differences. The Scorpion is an intense and intuitive creature, trusting instinct more surely than reason; a detached and lofty Gemini will rationalize and explain. They evolve together with a harmony of purpose, curiosity, and appetite. As long as Gemini is faithful, this pair of opposites will be a source of the greatest thrills of agony and ecstasy - especially in private."
	},
	"4_8": {
		"career": "These two water signs are sure to flow together very well on the work scene. Cancer's dedication and tenacity mix well with Scorpio's persistence and determination. Projects that require focus and resourcefulness are well suited for this pair. Both are emotional beings and are therefore able to become quite attuned to one another's needs.\n\nThere may be times when the Cancer's cautious nature wears on the discerning Scorpio. Once a Scorpio is confident, there's little that can slow him or her down! The flowing Cancer will need to place faith in this confidence. Further, the Scorpio is best to recognize that the Cancer's skepticism is often good.",
		"friendship": "Cancer and Scorpio just click. Sensitive Cancer understands Scorpio's driving passion. Perceptive Scorpio intuits the Moon Child's desire for a happy home life. But there are some sources of strain in this friendship. The Crab doesn't approve of Scorpio's vengeful behavior. The Scorpion can't stand when Cancer scuttles away to cry. Despite these differences, each will protect the other's interests. Cancer secretly enjoys giving painful pinches to Scorpio's enemies, while Scorpio openly loves avenging the Moon Child's hurt feelings. It's a strong and occasionally intimidating alliance.",
		"love": "Two Water signs dominated by sensuality... their sex life is likely to be thrilling! But is that enough? Cancer and Scorpio share a common craving. Both want to settle down; they claim to be monogamous, and instinctively sense the other's emotions. Both are comfortable in the realm of silence. However, Scorpio's rudeness may sometimes cause Cancer to recoil; Cancer's moodiness may be hard for Scorpio to bear. Moreover, Scorpio's overweening selfishness could wilt the strongest Cancerian love. If they endure, their love will be a symphony."
	},
	"5_8": {
		"career": "Combining the excitable energy of a Leo with the logical fortitude of a Scorpio can create an amazing team. The fiery lion loves to be on the go and in the spotlight. When it comes to entertaining or public speaking, a Leo is bound to be the star. Yet, when it comes to ensuring all of the background work is complete and that every detail has been considered when planning, it's definitely going to be the Scorpio that handles this the best. This partnership has very distinctive roles. The Scorpio is best behind the scenes, making sure that everything is in tip-top shape, whereas the Leo shines when out in the spotlight delivering the goods.\n\nThe possibility for conflict is present when roles are not specifically designated, or are unsuited to the person. Further, it's important for this team to recognize that the Leo is bound to be more gregarious and outgoing while the oft-introverted Scorpio prefers a quieter environment.",
		"friendship": "Both signs are emotional creatures that demand lots of attention. The difference is that Leo loves the spotlight, while Scorpio prefers operating in the shadows. When the Lion doesn't get the accolades they expect, they'll emit a mighty roar. If Scorpio isn't getting respect, they'll remain silent and formulate plans for revenge. When these two put an end to their power struggles, they can bring wonderful things to one another. Leo can help Scorpio look at the bright side, while Scorpio will assist the Lion in developing their creative talent.",
		"love": "Riven and driven, this couple wins the passion prize. Leo and Scorpio are locked in a struggle, united on the razor's edge. The emotional Leo is offended by Scorpian rudeness; in turn, Scorpio's deep feelings are masked by carnal urges. Tension and challenge define this relationship. Each is endowed with an infinite ability to wound or solace the other, and the two will endlessly oscillate between torment and delight. The clash of these two strong personalities is doomed unless indulgence and tolerance also reign. But selfishness may overcome them."
	},
	"6_8": {
		"career": "Combining the down-to-earth attributes of the Virgo with the go-with-the-flow methodology of the Scorpio creates a working team that can prove to be very industrious. Both signs are grounded in practicality and rigorous commitment to the job. A strong sense of purpose gives both the Scorpio and the Virgo all the energy they need. With a great attention to detail, the Virgo is strong beside the discerning Scorpio, making this a good duo for investigative work. Not much is likely to escape this pair's attention!\n\nBoth signs can also be critical of one another, and this can create some dissention if not recognized right off the bat. The best way to counteract this is to focus that critical eye back on the work, rather than on each other.",
		"friendship": "These two signs feel an instant bond. Virgo appreciates Scorpio's ability to intuit their emotions, while the Scorpion admires Virgo's keen intellect. When they join forces, exciting changes occur. Virgo is able to pinpoint the source of Scorpio's pleasure and pain. The Scorpion would be wise to take the Virgin's advice on cultivating contentment. Conversely, Scorpio is able to ease Virgo's anxieties, providing welcome reassurance during times of trial. These friends bring out the best each other, thanks to Virgo's brilliant mind and Scorpio's emotional intelligence.",
		"love": "The more the Virgoan probes the Scorpio's mysterious personality, the more surprises he or she finds. But the Scorpio's display of confidence spirits away the Virgo's anxieties. Also, the Scorpio may arouse the Virgo to unexpected frenzies of emotional intensity, especially in bed. These two signs have a great deal to learn from one another. They can observe, understand, and respect each other's private sides mutually: one is devoted to mystery and the other to business. And the intensely jealous Scorpio will find the Virgo to be unfailingly loyal and faithful."
	},
	"7_8": {
		"career": "When it comes to problem solving, this is one undeniable team. With their ultra investigative mind, getting to the root of the matter is one way the Scorpio shines brightly. Combined with the Libran's dedication to justice and peace, few would be able to get away with anything illegal or unjust. Analyzing is another strength for the Scorpio, while diplomacy is a strong suit for the Libra. This creates a strong balance of skills. This duo makes for an excellent team in the field of criminology, investigative reporting, or intensive research.\n\nThe Scorpio's proclivity to sarcasm can create some challenge for the Libra when this part of the person's character is misunderstood. The Libran will need to gain insight into this means of release and humor. On the flip side, the Libran's tendency for idealism will need to be accepted by the practical Scorpio.",
		"friendship": "Libra and Scorpio make an uneasy alliance. Librans are gracious, fair-minded, and logical. Scorpions are intense, passionate, and emotional. When they become friends, it's because they want to help each other. Libra can show Scorpio how to approach problems logically. Scorpio will instruct Libra on summoning their resolve. Together, they can avoid pitfalls they'd otherwise suffer. Of course, Libra is uncomfortable with Scorpio's dark moods, while Scorpio detests Libra's tendency to break promises. If they can handle the bitter with the sweet, these friends can survive.",
		"love": "This unusual combination of Water and Air may spawn either the best or the worst. The Libran's intellectual grace thrives on the Scorpio's emotional profundity, and vice-versa. Libran eloquence may also draw Scorpio out of his silence, and facilitate the Scorpio's efforts to make new contacts, although the latter will still need periods of solitude in which to resume his old patterns. The Libran preoccupation with commitment is compatible with the Scorpio's possessiveness. Their journey through life together may be long and passionate. This is a union of light and dark."
	},
	"8_8": {
		"career": "You can expect to feel a deep, underlying understanding of one another when two Scorpios are in the same space. Little needs to be said between this pair. Most communication is instinctual. Considered the sign of shared possessions, this water sign is well known for its resourcefulness, sense of purpose and discerning disposition. Working together will flow without much effort.\n\nThere aren't likely to be too many challenges between the two; however, how others perceive the witty humor, sarcasm, and sometimes seemingly obstinate interaction between them can be another thing all together. Given the nature of the Scorpion, others' perceptions won't concern them in the least. They must ensure that this doesn't come across as pure arrogance or neglect.",
		"friendship": "This highly psychic sign has great instincts about who can support them. That's why so many Scorpions have at least one fellow member of their sign in their social circle. Scorpio knows they can rely on this pal to alert them to trouble, offer truthful feedback, and affirm their feelings. It isn't all smooth sailing with this friendship, however. Scorpions are jealous. They feel threatened when other friends try to supplant them (literally or possibly). If they manage to control their envious and competitive sides, it can be a positive bond.",
		"love": "One of the most erotic pairings possible, the Scorpio duo ecstatically merges in the depth of shared emotion. Both endowed with hyperintuitiveness, they sense each other's needs without speaking, communicating in an intimate and profoundly aquatic personal language. The only danger they must beware of is their possessiveness, which can undermine their happiness. When jealousy sets in, they can spy on and torment each other into sheer agony. If only this pair of Scorpions could live alone on some deserted island, nothing could trouble their bliss. It would be Paradise!"
	},
	"1_7": {
		"career": "The combination of these two signs can create a strong balance when each shares their unique skills with a healthy respect for the other. Aries and Libra are astrological opposites. Fiery Aries brings strength and recognition to the individual self, while the fair-minded Libra demonstrates the power of partnership. These different perspectives on working can create a harmonious relationship that covers all the bases.\n\nBecause the Libra and the Aries are so different, challenges can arise. By demonstrating patience and respect, most difficulties will be eliminated. Simply acknowledging that this is a team of opposites is half the journey. Blending abilities sets the stage for great potential and achievement.",
		"friendship": "Independent Aries and collaborative Libra form a funny sort of friendship. Aries tries convincing Libra to take chances, shake off criticism, and be more direct. Libra constantly tells Aries to slow down, smell the flowers, and be more appreciative. It's an odd couple type of relationship that can work extremely well. Aries can learn the fine art of diplomacy from Libra, while Libra may become more assertive thanks to Aries. At times, they'll go their separate ways. Aries will head for the sports arena, while Libra will visit a museum. They need their own friends, not just one exclusive clique.",
		"love": "Two signs which naturally attract and complement each other. Tactful Libra tones down the Ram's fury, and redirects his or her individualism towards a partnership whose logical conclusion is the marriage which matters so much to Libra. The Libran harvests the Ram's vigor, but is sometimes rebuffed by blunt language. Aries must be careful to give Libra time to express him or herself. Otherwise, the magnetism which attracts them may turn into mutual repulsion."
	},
	"2_7": {
		"career": "When the work requires a team that can get to the heart of the matter, this combination is apt to do well. In many regards these two signs balance each other out. While the Taurus is determined, a creature of habit, and ready to use their elbow grease, the Libra is easy-going, adaptable, and possesses a keen sense of the best approach. Architectural, mechanical, and horticultural fields are great for this pair.\n\nIf the Taurus becomes too rigid or the Libra is indecisive, challenges will arise. By openly discussing these issues and actively seeking a workable solution, this duo will be back at it in no time.",
		"friendship": "Although Taurus is an Earth Sign and Libra is an Air Sign, both are ruled by Venus. This means that beauty, luxury, and harmony will be the foundation of their friendship. Taurus is more highly attuned to physical representations of beauty, like colorful jewels, delicious food, and rich textures. Libra prefers ethereal types of art, like writing, music, and poetry. They love talking about their favorite artists. Taurus despairs of Libra's spendthrift ways and Libra thinks Taurus is overly stubborn, but they'd never dream of levying insults at each other.",
		"love": "The fact that both signs are influenced by amorous Venus gives their relationship a romantic and sensual outlook. But the sociable Libran's appetite for entertainment and conversation may be stifled by the Bull's stolid contentment with home and hearth. If the charm is broken, the Libra will soar alone. Moreover, Taurean inarticulateness may repel loquacious Libra. Yet with a little flexibility and subtlety, if these two partners want their relationship to last, it can!"
	},
	"3_7": {
		"career": "A great deal of imagination and dreaming is sure to happen when two air signs work together. Noted for their ability to visualize and brainstorm, both the Gemini and the Libra will come up with solutions to problems that can boggle their coworkers' minds. Ingenuity is a strong characteristic for the Gemini, whereas creating balance and ensuring justice are the Libran's strong suits. Work that involves problem solving, creation and advocating are great matches for this team.\n\nSometimes both of these air signs can have their heads in the clouds, so to speak. This poses challenges when practicality needs to be the priority, or when hands-on work is required. The Libra and the Gemini can ground one another with a quick reminder of the down-to-earth work that needs to be finished.",
		"friendship": "Gemini and Libra are boon companions that adore one another. As soon as these two get together, they are laughing and exchanging ideas. They love making plans together, but rarely stick to the planned out program. That's because both these signs go where the wind takes them, easily abandoning a good prospect for a great one. There are some complications with this friendship. The Twins lack Libra's diplomatic skills, while Libra is a bit too dependent for Gemini's taste. Fortunately, neither of them holds a grudge.",
		"love": "When Air meets Air, love is a breeze. This refreshing, carefree duo sparkles with optimism. Gemini's sociability reinforces Libran elegance. In the outer world, they are graceful and entertaining dancing partners, complementing and understanding each other perfectly. They love communication, outings, travel, surprises. Libra appreciates the conjugal bond, but is delicate enough to let Gemini decide for him or herself. In any case, their daily life together is such a joy they are inseparable..."
	},
	"4_7": {
		"career": "The gentle nature of the Cancer unites with the harmonious quality of the Libra to create a soothing relationship. Not only will this working pair find very little to stress about in one another's company, the entire environment, and everyone in it, will benefit. Sensitive yet tenacious, the Cancer prefers work that is steady. Clear guidelines and direction suit this water sign well. As for the Libra, this sign is known for its easy-going way. Further, you can expect this charming air sign to be diplomatic, and keen on justice being done.\n\nDue to the smooth atmosphere and presence with one another, few challenges will come up for these two directly. Outside pressures to perform work tasks that are unclear, confusing or disorganized can make for a tense moment or two.",
		"friendship": "Cancer and Libra are an odd couple. The Crab prefers dealing in the realm of emotion, while the sign of The Scales occupies the land of logic. Despite these differences, both signs are excellent leaders. They know how to bring people together in a spirit of harmony. Cancer admires Libra's fair treatment of others, while Libra appreciates the Crab's humorous approach to problems. Together, they'll have fun organizing parties, fundraisers, and business ventures. These two also love music and can commune over their favorite singers, performers, and bands.",
		"love": "No doubt the moonchild is enchanted by the Libran's sense of harmony and generosity. But lifestyle differences are likely to become insurmountable obstacles early on. Home-loving, maternal Cancer cannot tolerate Libra's whirl of parties and entertainment. Libra thrives on company, excitement, communication, networks of relationships. If Cancer cannot broaden his or her social horizons, misunderstanding, irritation, and frustration will ensue."
	},
	"5_7": {
		"career": "This is an outstanding team for any work that requires sales or performance. Not only are both signs creative and artistic by nature, they are also easygoing and social. Libra's innate need for harmony and balance brings grounding to the adventurous and blazing Leo. By the same token, the entertaining Leo can bring more of the Libran's inner talents out into the open. This is a duo that is certain to get along well together.\n\nAs far as challenges go, the Leo is certain to see the disapproving aspect of the Libra should work or circumstances begin to get out of hand. The Libran will not tolerate extremes well at all. Further, the Leo resists confinement and needs ample space to expand.",
		"friendship": "Leo and Libra make fabulous friends. Both are lovers of life and fuel each other's positive energy. Leo is enchanted by Libra's wit and sophistication, while Libra adores the Lion's warmth and generosity. Forceful Leo laughs at Libra's indecision, while collaborative Libra mocks the Lion's selfishness. Fortunately, each finds the other's weaknesses relatively minor. Both enjoy being entertained and will often accompany each other to movies, concerts, and plays. They're also enthusiastic game players and may enter trivia contests, poker tournaments, or sporting competitions.",
		"love": "Eloquent, artistic, and honest, these two signs share many touchstones and easily accommodate each other elsewhere. The Libran individual, incurably wishy-washy, will adopt the Lion's determination if it seems fair. And the Lion laps it up! Leo fulfills the Libran's desires, rubbing him or her the right way and expressing boundless love, especially in the physical sense. Friends and lovers, Leo and Libra derive strength from each other to parade splendidly, in dignity and grace, through the outer world. Their love is an intelligent device."
	},
	"6_7": {
		"career": "This is a working pair that can gain a great deal from one another. The earthy Virgo enjoys details, and will tackle a project with such meticulousness that the results are near perfect. Strong, social, and conscientious, making decisions generally comes easy for this person. This can benefit the Libra, as this is an area that is often challenging. On the other hand, the Libran can really give the Virgo a sense of balance. Oftentimes a Virgo is strict with themselves and their conduct. The Libra can help by showing his or her coworker the lighter, more flexible aspects of doing jobs.\n\nIn the event that the Libran feels overly restricted by the Virgo's routine, challenges can arise. This isn't apt to show right away, either. The Libran values harmony and can be very resistant to rocking the boat with a coworker. Over time, however, pressure can build and a blowup might ensue. Dealing with issues as they happen is the only way to avoid this.",
		"friendship": "It takes time for Virgo and Libra to appreciate one another. At first, Virgo thinks Libra is frivolous. Meanwhile, Libra finds the Virgin pedestrian. If each gives the other a chance, these two can find a real mutual affection. Both are extremely polite and helpful. They will learn they can depend on each other. Virgo will assist Libra when they become overwhelmed with work, while Libra will rescue Virgo from awkward social situations. These smart signs will also like exchanging ideas about everything from politics to art to sports.",
		"love": "These two emotionally remote signs are likely to strike up an intellectual understanding. They enjoy being together to argue, work, or attend social events. Both are blessed with grace and tact. From the Libran, the Virgo derives the enthusiasm which sometimes fails him or her, but may criticize the other for his endless need to charm. As for the Libran, he or she is liable to be bored. The Virgo partner works so hard he has little time for love. This couple is not easy to construct, but it may thrive once a bond has formed."
	},
	"7_7": {
		"career": "Work requiring a team that is dedicated to the truth, justice and law enforcement is perfect for one Libra, let alone two! This pair will have no problem coming together to get the job done. With the Libra's objective way of looking at situations and people, a unique perspective is the advantage. This air sign is generally relaxed and loves a sense of harmony and balance. Together, this is apt to be created automatically.\n\nChallenges for the Libra often involve indecisiveness. Being able to detect what needs to be done or corrected is not the problem. Making the decision on how to do it - and when - is. Talking the issues out together can bring options into the forefront, making this a far easier area for both to deal with.",
		"friendship": "Libras love to befriend members of their own sign. These people prize equality above all else. Having a friendship devoid of power struggles brings out the best in them. Although these two won't make decisions quickly - if at all - they'll enjoy discussing endless possibilities about where to eat, which movie to see, and how to best arrange their schedules. Exploring their options is a favorite activity of these pals. Both enjoy art, beauty, and luxury, so they'll spend much of their time going to museums, concerts, and movies.",
		"love": "As they size each other up, they perceive the other's flaws, which they cannot correct since their own are identical. The relationship is swollen with superficiality, because the Libran is reluctant to explore profound emotion. But the couple's worldly and glamorous qualities give them a boost. What happens after the guests go home? These two individuals love each other without seeking true union, without engaging in emotional displays, perfectly satisfied with a life oriented towards social events. Be warned that unfaithfulness is quite possible."
	},
	"1_6": {
		"career": "The combination of talents and energies of these two signs can come together and create a highly productive team. The Aries of the team brings strong leadership and initiative. When it comes to strategizing, and then taking the steps to make success happen, this fiery personality rises to the top. Getting the nitty-gritty work done is where the Virgo really shines. With a tactile and very hands-on in approach, this hardworking earth sign gets the job done. The Aries can provide the initiative to get the ball rolling.\n\nPossible conflict can arise when the Virgo leans towards absolute perfection in all he or she does. Attention to detail is not a strong quality for the Aries, and when things take too long, frustration can make tempers flare.",
		"friendship": "Heroic Aries and helpful Virgo are both service-oriented people. They may strike up a friendship while doing volunteer work or performing some selfless task. Although Aries doesn't have a filter and says whatever pops into his or her mind, Virgo is extremely conscientious and carefully censors their words. Aries thinks Virgo is too sensitive, while Virgo feels Aries is bombastic. Fortunately, the Ram appreciates it when the Virgin fixes their public relations disasters, while Virgo is grateful when Aries pushes them to take risks. Each brings something valuable to the other's table.",
		"love": "Virtual opposites: The Virgo is a diligent worker, a faithful partner, and a born organizer; sparkling Aries lacks ongoing commitment but has pizzazz. He may sometimes chafe under Virgo's critical gaze. The Ram will dominate the pair, and his or her unpredictability will wreak havoc with Virgo's plans. But Virgo gives backbone to the Ram's impulses, and guides him or her with valuable advice. The alchemy of opposites forges a constructive but continually strained relationship."
	},
	"2_6": {
		"career": "When it comes to good old-fashioned work ethics, it's tough to beat this pair. With the Taurus' determined nature and the Virgo's meticulousness, work is done exceptionally well. This duo can come together on a moment's notice, receive directions, and get down to it without any problems. Jobs that require a hands-on approach such as mechanics, agriculture, and building are excellent for their talents.\n\nBoth the Taurus and the Virgo can be stubborn at times. Each is usually set in their ways and veering off from that which won't come easily. This team may need to work on their flexibility in order to maintain friendliness.",
		"friendship": "Taurus and Virgo form a strong friendship that can stand the test of time. While it's true that Taurus is slow to admit mistakes and Virgo is quick to point out errors, these two rarely argue. That's because they both value stability. Taurus knows how to spot good values and help Virgo make the most of their money. Virgo knows how to read the fine print and can assist Taurus in negotiating better deals. Together, they make great allies. A shared love of nature cements their bond.",
		"love": "Two Earth-ruled signs which value tranquillity and discretion, they have all the ingredients for a harmonious love affair. Anxious Virgo finds reassurance in the stolid Bull, whereas the Taurean derives needed peace and energy from the Virgoan. A caress, a gaze, a gesture: each is worth a thousand words, when it comes to expressing the tenderness that binds them together. Taurus dominates, to the delight of clinging vine Virgo. \"The power of harmony, and the deep power of joy...\""
	},
	"3_6": {
		"career": "The earthy Virgo is one to get the work done in a conscientious way. This person can be exacting, even meticulous with anything they put their name on. Combined with the Gemini's love of keeping busy, and flair for being intellectual and witty, an industrious team is created. Both the Virgo and the Gemini have a love for beauty in surroundings and appearance. Work that requires an eye for detail, such as interior decorating or architectural planning, is an excellent match for this duo.\n\nOftentimes both the Gemini and the earth will want to decide what details are most important, and this can create a clash of opinions. With Gemini's ability to communicate and Virgo's commitment to staying on track, this couple can tackle problems in no time.",
		"friendship": "Although Gemini is an Air Sign and Virgo belongs to the Earth, these friends do have lots in common. Both signs are ruled by the planet Mercury, conferring high intelligence. These two love sharing book, film, and music recommendations. They also collaborate very well. Gemini prefers to generate the ideas, while Virgo is great at implementing them. Gemini bristles at the Virgin's quest for perfection, while Virgo is exasperated by the Twins' refusal to take work seriously. Still, each admires the other's special brand of wisdom.",
		"love": "Signs ruled by the planet Mercury, Gemini and Virgo are busy: one bubbles, while the other is purposeful. Creatures of reason, they can spend hours discussing their work, their friends, and their plans. Virgoan modesty loosens its bonds in the intimate surroundings of the bedroom, whereas Gemini's fires tend to burn low. Both are naturally anxious, and they may either reassure each other or, on the contrary, worry each other. This is the key to this cerebral pair, which may benefit from real affinities and an inexhaustible potential for happiness."
	},
	"4_6": {
		"career": "Resourcefulness and practicality are the gems this working couple brings to the table. Flowing Cancer also lends a quieter, relaxed energy that can soothe the savage beast, while Virgo's incredibly strong work ethic ensures the best job possible. Not only will this team come together well in energies, they will also find working together comfortable. The Virgo person often harbors a strong caring instinct. This bodes well with the Cancer, whose instincts often favor relationships above all. Work that involves care giving, management or assistance is well suited.\n\nChallenges arise when the Virgo becomes overly critical, or when the Cancer is feeling melancholy. Further, the emotional water sign can take the Virgo's well-meaning advice harshly at times, making it imperative that opinions are communicated tactfully and instructions are explained clearly in advance.",
		"friendship": "These two signs have a healthy respect for one another. Cancer has solid values, preferring to cultivate relationships with quality people. Virgo has pure principles, refusing to be swayed by offers of money and status. When the Moon Child and Virgin come together, they feel supported. Of course, Cancer can't abide Virgo's nitpicking. Conversely, Virgo will barely tolerate Cancer's emotional outbursts. Eventually, the Moon Child will teach Virgo the value of unconditional love, while Virgo will teach Cancer not to cry over trivial matters.",
		"love": "This couple glows with a tranquil aura of harmony. Virgoan organizational skills reassure the anxious Crab, whereas the latter brings Virgo love and imagination. The devoted and dutiful Earth sign will never be wicked enough to push Cancer's buttons. The moonchild's moods are tolerated and coaxed back to less slippery terrain with patience and rationality, in the affectionate surroundings the Cancerian craves. Their life is orderly and calm, but never dull. They love each other simply, tenderly, and gracefully."
	},
	"5_6": {
		"career": "The Leo's dedication to duty and loyalty combined with the Virgo's shrewd ability to focus makes this partnership strong. When there's a job that needs to be done, neither will buck. In fact, this team may be the first on the scene! Each sign is hardworking and prefers to do things the right way the first time, so to speak. Neither will shy away from the tough, elbow-grease jobs that must be tended to every now and then in any occupation. Strong and confident, the Leo merges quite well with the routine-lovingVirgo.\n\nBoth of these signs are tenacious in nature, and both are capable of leadership. Challenges will arise when each person has their own, exclusive idea of how the work should be handled. Finding a compromise is apt to be a skill this couple will have to develop.",
		"friendship": "Leo and Virgo are funny friends. Leo is grandiose, while Virgo is humble. The Virgin is critical, while the Lion is effusive. Despite these differences, Leo and Virgo can greatly benefit from each other's company. Leo can reconcile Virgo to their sensual side. Virgo can warn trusting Leo of opportunists in their midst. Both want to maintain optimal health, and may share wellness tips. Of course, Leo will accuse Virgo of being uptight, while the Virgin will charge the Lion with being selfish. They'll never change each other, though.",
		"love": "Does elegance admit rivalry? Only in this case, where two different realms are involved. One partner is brilliant; the other, refined. The methodical, intellectual Virgoan may sometimes be irked by Leo's need to parade. Or, heaving a sigh, submit happily and work behind the scenes to rein in the Lion's munificence and extravagance. In exchange, the Virgo receives inalienable, intense, and generous love which is tinged with torrid eroticism. To make the pleasure last, Virgo must overcome his or her legendary anxiety and assuage the Lion's every desire."
	},
	"6_6": {
		"career": "Many times the best match for any sign is another person with the same sign, and when it comes to the Virgo, this is often the case. Dedicated to a meticulous, exacting approach, this hard-working earth sign does an incredible job. Two on the task can only mean a great product or service that is conscientious and complete in every respect. Services that involve doing for others - from cleaning to organizing charity drives - are excellent projects for this team to shine.\n\nIt's a good idea for each Virgo to remember the \"Golden Rule\"- treat each other as you would prefer to be treated. This can go a long way for damage control when it comes to offending a fellow Virgo with criticism or interference.",
		"friendship": "Two Virgos can bring each other to tremendous heights or terrible depths. Both are intelligent, discerning individuals who are always striving for perfection. They're eager to hone each other's talents to diamond-like brilliance. At times, Virgo's hypercritical tendencies can cause problems. These two should take care to give each other constructive advice instead of cutting comments. Both have a deep appreciation for earthly pleasures like food, flowers, and fauna. They'll have a great time visiting beauty spots around the world. These book lovers will also enjoy plundering each other's libraries.",
		"love": "Narcissism or partnership? This identical pair may be a whiz at business, but emotional fulfillment is likely to elude them. Together, they contain an overdose of caution, modesty, and dutifulness. However, should they both resolve to put tenderness uppermost, the two Virgoans will communicate well. They share a singular passion for work and common sense which liberates them from many a sentimental or trivial constraint. Both thrive on intellectual activities and may happily spend the day reading or writing. But is that the purpose of love?"
	},
	"1_5": {
		"career": "This team is sure to take on any work project with as much energy and power as a lightening bolt! Bringing a fire sign together with another fire sign sets the scene for unstoppable drive and determination. The Aries brings a competitive edge and innovation to the team while the Leo provides the planning and communication skill. Getting the ball rolling is what the Aries does best, and presenting is an innate gift for the Leo.\n\nWhen both parties in this team recognize what each does best and stick to this division of tasks, there isn't apt to be much in the way of challenges. This is a powerful combination!",
		"friendship": "Bold Aries and fun-loving Leo generate lots of excitement together! That's because both these friends are Fire Signs. Aries is the more outgoing of the two and may prefer seeking adventure while Leo luxuriates in comfort, waiting for a full report. These friends are also extremely active and may enjoy playing sports, thus bringing out each other's competitive side. Neither sign is a particularly gracious loser, so some heated arguments can erupt on the field or court. For the most part, however, each friend will bask in the other's glow.",
		"love": "Aries decides, but the Lion rules. Each must be careful not to offend the other's vanity, because the most trivial events can become power struggles. However, the ardor and passion which animate both Fire signs may weld the two individuals into a radiant couple. Adventure, creativity, and success are on the horizon. Love is a matter of tenderness, desire, and submission. But perfect harmony will require respect for Leo's pride."
	},
	"2_5": {
		"career": "The practical, down-to-earth nature of the Taurus creates an excellent balance with the dynamic and creative Leo. The Taurus enjoys hard work, getting into the nitty-gritty of the project with a slow, methodical pace. This is considerably different from the Leo's faster approach, yet since this fire sign also thrives on doing a job well, it works out well. Combining energies might take some adjustment, but it's well worth the effort. This is a good mix.\n\nChallenges will arise when the Leo is impatient with the Taurus' slow but steady pace. With the Taurus' stubborn nature and temperament, frustration can build up over time leading to a blast at the Leo. Communicating is as much a key to this kind of difficulty as is patience.",
		"friendship": "Taurus and Leo have more in common than meets the eye. Both love luxury. Each is extremely loyal. The two of them are incredibly stubborn. When they become friends, it's usually because they appreciate each other's taste. These two can often be found shopping, eating, and making or appreciating art together. Taurus hates being ordered around, which can cause problems when Leo issues royal commands. Leo dislikes Taurus's frugality. Fortunately, they're both very friendly. Most days, they prefer having fun to fighting.",
		"love": "Birds of a feather flock together, and these two signs have a great deal in common. Deep down, they are erudite, sensual, sensitive, and artistic. Mutual contact reinforces the talent of each. But the extravagant Lion may clash with the discreet and thrifty Bull, and if Leo does not temper his or her selfishness, the Taurean partner will feel hurt. The couple, which is stormy in the intimacy of the bedroom, cannot weather daily life unless each makes a continual effort to accommodate the other."
	},
	"3_5": {
		"career": "The versatility of the Gemini blends wonderfully with the enthusiastic Leo. This combination of people has a strong balance of differences and similarities. Whether the work at hand requires imagination and creation, or the project is already in the works and requires a team that can see it through, this couple can do it - and do it well. Getting an idea off the ground and developing it into something tangible is another area that is sure to be strong. Enjoying work is important to the Leo as well as the Gemini, lending an air of Positivity to their work environment.\n\nThere aren't apt to be too many challenges for this team. In fact, they may find they have too much fun with one another. This can be difficult when there's a great deal to accomplish, and little time to do it in. Reminding each other to put work before pleasure can keep them on track.",
		"friendship": "Effusive and affectionate, Gemini and Leo form a fast friendship. They form a mutual admiration society that is positively addictive. Gemini is quick to appreciate Leo's style, creative talent, and warmth. Leo loves laughing at Gemini's witty remarks. These two are very adventurous and enjoy getting into trouble together. Fortunately, Gemini is an expert at talking their way out of punishments. This is the one instance when Leo should follow their friend's lead. At all other times, Gemini should defer to Leo's sizable ego. This is a fun-loving pair.",
		"love": "Both appreciate extravagance, dazzle, and glitter; the Air of one feeds the Fire of the other. Leo's idea of love is grandiose, and Gemini will be fascinated by the attentiveness of his partner. His (or her) curiosity is never satisfied, and the Leo is full of surprises. A helpful hint to the Gemini: be careful of the Leo's pride; don't arouse his or her ire. Helpful hints to the Leo: rein in your possessiveness, because the Gemini wants to be as free as Air. If these prerogatives are respected, love will be colorful and joyful."
	},
	"4_5": {
		"career": "While this couple can appear to be completely opposite at first glance, this is not apt to be the case! The easy-going, imaginative, and kind nature of the watery Cancer merges very well with the generous, creative spirit of the fiery Leo. Both signs are highly emotional. Perhaps the greatest difference is each person's willingness to be in the spotlight, or out front about being the main focus. A Leo loves to be noticed and lives to take center stage, whereas the Cancer generally prefers to work his or her magic in the background.\n\nChallenges for this working pair are sure to be few in number. Both will do well to praise one another regularly for their contributions, letting appreciation and good will flow freely. Creative work is an excellent outlet for both.",
		"friendship": "At first, Cancer and Leo don't know what to make of each other. Modest Cancer is shocked by proud Leo's bragging. Fun-loving Leo can't understand Cancer's tearful outbursts. Instead of writing each other off, these signs should take a second look at each other. The Moon Child can greatly benefit from Leo's playful attitude. The Lion can become more sensitive under Cancer's tender influence. They're both extremely loyal and will stick together through thick and thin. This friendship can be a rewarding balancing act of energies.",
		"love": "The tides of the Moon and the Fire of the Sun... A strange alliance dominated by the Lion's strong personality. Leo dazzles, spends, adores. If the Cancerian is too maternal, too watchful over the family budget, or too critical of the Lion's extravagance, the latter may feel smothered, the way Water extinguishes Fire. But Leo's generosity should charm any Cancer partner. At home, the Lion accomplishes his role with majesty, which can only delight the timid Crab."
	},
	"5_5": {
		"career": "Few can boast the generosity and kindness that a Leo can, and with two working together, great things are sure to manifest. Creative and open-minded, this fiery combination loves to succeed. Projects are taken on with enthusiasm and vigor. With such a flair for the dramatic, entertainment-related work is very well suited to the Leo.\n\nEvery Leo tends to face challenges in the areas of intolerance, patronizing disposition, conceit and pride. These characteristics, if present in either Leo in this team, will bring disruption. Work that allows ample leadership for each person is ideal. However, when the tasks must be divided equally, it will be apparent to this duo that they must sit down and flush out the best plan of action.",
		"friendship": "Two Leos are a bundle of fun, but they can encounter trouble in their friendship. Each has a royal bearing and won't defer to anyone else. Unless these pals decide to hold court together, power struggles will occur. When they have a difference of opinion, neither will budge. Fortunately, these two are united on many fronts. Both love art, luxury, and entertainment. They have a fondness for sports and adore luxuriating in the sun. If they can tame their egos, this friendship will thrive.",
		"love": "Talk about a dazzling duo! Distinction, elegance, generosity, talent, social prominence... they have it all. In company, they shine, expressing their passion unabashedly, spending extravagantly. But each partner in this regal pair had better choose a different realm, because neither is likely to enjoy sharing power. No one solar system has room for two Suns. And the Leo's conquering spirit is not given to compromise. If each respects the pride of the other, this couple will accomplish great things."
	},
	"1_4": {
		"career": "This team not only works well together, but they often enhance one another. In many regards, the Aries and Cancer are opposites. The Aries is outgoing, gregarious, and ambitious whereas the Cancer maintains a far more subtle and even stoic presence, preferring a gentle, flowing approach. The fiery Aries can at times burn hard and fast. The Cancer is excellent for keeping the Aries' energy anchored and focused. On the other hand, the Cancer benefits from the daring ways of the Aries, by venturing into new areas.Each person in this team needs to have flexibility and a willingness to try a different approach. Without this, challenges can occur. Fire and water can douse the spark; however, with openness they can learn a great deal from each other.<%}%>",
		"friendship": "When these two Cardinal signs get together, amazing things can happen. Both Aries and Cancer are wonderful leaders. Aries is willing to take creative risks to succeed, while Cancer is able to tap into public sentiment. As a result, these friends may spend much of their time developing ideas for businesses, fundraisers and parties. At times, Aries's direct approach will send shy Cancer scuttling for cover. At others, Cancer's guilt trips will dampen Aries's enthusiasm. For the most part, though, these friends appreciate and celebrate each other's strengths.",
		"love": "Sensitive, gentle, subtle Cancer is likely to be offended by the Ram's sometimes brutal impulsiveness. One worships the family; the other feels hemmed in by it. Dynamic Aries resents being tied down to the home and hearth primordial to Cancer, and Cancer is likely to withdraw into a prolonged sulk if he or she feels abandoned. Only shared compromise, patience, and attentiveness can build this couple. However, the Aries will always be the boss."
	},
	"2_4": {
		"career": "The blending of the Taurus' love for working with their hands with the Cancer's sense of loyalty and dedication makes a wonderful team. Both earth and water signs are hardworking and like to follow a structure. Being organized and sticking to a routine suit both of these workers very well. As coworkers they are not apt to experience a lot of difficulties; they are far too much alike in ethics.The melancholic, emotional side of the Cancer and the stubborn, rigid side of the Taurus can prove to be somewhat challenging on a more personal level. In short, these two can get on each other's nerves. Time alone or some down time together will lead to resolution.<%}%>",
		"friendship": "Taurus and Cancer often feel an immediate kinship. Both are security-conscious. They take pleasure in steady jobs, loving families, and comfortable homes. They're both very creative, too, and enjoy collaborating on everything from meals to gardens to handicrafts. Sometimes Taurus seems too obsessed with money for Cancer's taste, while Cancer appears overly sensitive to Taurus. For the most part, each is able to tolerate the other's weaknesses. Instead of trying to change one another, both signs choose to celebrate their friend's strong points. That's the secret of this strong friendship.",
		"love": "Could this be the ideal couple? Both partners are unabashed homebodies, delighting in simple pleasures: family life, good food, comfort, and prosperity. They cook up their own candlelight dinners, enjoy quiet evenings alone together, and plan their investments wisely, whether they're financial or personal. Mutual enrichment, comfort, and support are virtually guaranteed. They form a self-sufficient couple, a world unto themselves... as long as their home is comfortable and attractive!"
	},
	"3_4": {
		"career": "The combination of these two signs creates an amiable and comfortable energy. Each is generally willing to consider the other's viewpoint, and both enjoy conversation. Communication is a strong quality for the Gemini, making it easy to share ideas and to determine the best course of action for a job. Cancer's easy-going nature suits the Gemini, and can bring a sense of calm when the pressure is on. Both thrive when having a set course ahead of them, with clear directions. Orderliness, efficiency, and strategy are important to each of these personalities.\n\nOutside influences that create chaos, confusion or upset do not go over well for both the Gemini and the Cancer. Ensuring that the working environment is set up the way these two prefer will lead to a harmonious relationship.<%}%>",
		"friendship": "This friendship doesn't come naturally, but it can be very rewarding. Gemini is highly intellectual, while Cancer is extremely emotional. The two friends have radically different reactions to life, which is a good thing. Gemini can help Cancer realize that while feelings are important, they can be controlled. Cancer will show Gemini the value in forming lasting, heartfelt relationships. The Twins don't understand the Moon Child's obsession with economic stability. Conversely, Cancer doesn't get why Gemini can't sit still for two minutes. Mostly, they laugh at each other's quirks.",
		"love": "The road looks rocky. Cancer hopes to found a stable, comfortable home for a family; Gemini has an appetite for change, danger, and travel. If he or she feels free to come and go, he or she will appreciate the Crab's profound and genuine feelings; in return he or she provides great cheerfulness. Gemini's sociability helps the Crab out of his shell. But the latter will always be the first to want to go home to bed. If Gemini can squeeze out a bit of stability, and if Cancer can repress his or her tantrums, they'll love each other the way Air mingles with Water."
	},
	"4_4": {
		"career": "When it comes to work projects that take time, and those that require plenty of stamina to make it to completion, this is definitely a team that won't disappoint. \"Slow and steady wins the race\" is the success formula for this working duo. In fact, avoiding any tasks that need to be done quick is generally a good idea. This Cancer team does extremely well with projects that require commitment.\n\nChallenges can occur when either or both Cancers are feeling blue, or are torn about happenings in their personal lives. Their heart is going to be more at home than anywhere else to begin with, and if there's an issue going on, they will find it next to impossible to focus on the work at hand. <%}%>",
		"friendship": "Cancer has uncanny instincts about people. That's why they attract each other like magnets. Both share a weird sense of humor that few others understand. When two Moon Children get together, they start laughing like lunatics. Often, they seem like they're speaking a special language of their own. They both know how to make money and hold on to it. As a result, they often use their friendship as a launching pad to a successful business. At times, their extreme mood swings can cause them to snip at each other.",
		"love": "Two halves of a romantic whole influenced by the Moon, they will spin a cocoon around themselves and the family they either already have or dream of having. This outer harmony is underpinned by a visceral need for intense emotions, the fusion of bodies, profound union. The Cancerian personality, turned towards the past, is sometimes unhappy in the present. Indulgence, tenderness, and forgiveness are the keys to the changing moods of this Water sign. If the couple separates, each half will wander like a lost soul, until a new love provides a lift."
	},
	"1_3": {
		"career": "The combination of Gemini's ability to envision with Aries' physical endurance and drive makes this a team with tremendous potential. A Gemini is highly imaginative, and can encourage an Aries to \"think outside the box.\" Once an idea is on the table, an Aries has the motivation to make things come to life.\n\nChallenges can occur when the Aries doesn't acknowledge the duplicity of the Gemini. While this air sign can be a great generator of ideas, an Aries may need to expect times when their partner may be stubborn, analytical, and adamant that they're right. Patience is the key to this team bringing out the best in one another.",
		"friendship": "This is an incredibly dynamic friendship that seems to run on rocket fuel. Aries loves putting Gemini's brilliant ideas into practice. Gemini has fun egging Aries on to glory. Together, great things can be accomplished. These two friends make wonderful creative collaborators. The only downside to this alliance is a tendency toward heedlessness. Aries has no fear of danger and Gemini is always eager to see what's around the corner. This can cause some unfortunate accidents. The best gifts these friends can give each other is safety equipment.",
		"love": "A promise of great excitement and entertainment! Both signs are endowed with good cheer and optimism, which makes them perfect pals. Life together is like an ongoing party, highlighted by flashes of imagination and friendship with others. Gemini easily adapts to the demanding Aries character, while Aries finds his or her partner to be an inexhaustible source of fresh air. The couple lives for the moment, with scarcely a care for tomorrow, but this continual improvisation is not the stuff of which lasting ties are made. Stay tuned for more adventures..."
	},
	"2_3": {
		"career": "Gemini folks combine practicality and a keen sense of planning with strong imagination and creativity. Aligned with the Taurus' commitment to working as hard as it takes to do the best job possible, a wonderful working relationship is created. No help is needed to get everything in order before moving forward and tending to the task. Further, this is not a couple that will need much supervision, if any.\n\nWhen it comes to getting their hands dirty, the Taurus won't hesitate. This, however, doesn't always suit the Gemini and is worth keeping in mind when determining the division of labor. There's no concern about either party not pulling their weight, but recognizing where each person is more comfortable will prevent any challenges.",
		"friendship": "Practical Taurus and whimsical Gemini have different approaches to life. Taurus doesn't like to take risks, while Gemini loves exploring new horizons. The Bull craves security, while the Twins yearn for variety. When these two signs do form a friendship, it's usually on the basis of a mutual interest. Both Taurus and Gemini place a strong emphasis on hobbies. There's a good chance they could connect in a cooking, foreign language, or art class or workshop. Taurus appreciates Gemini's brilliant insights, while Gemini admires Taurus' great taste.",
		"love": "Gemini is a sociable, gregarious extrovert who loves the bustle of the city, while Taurus is quiet, quaint, and rural. The Bull seeks comfort and tranquillity, whereas Gemini's phone is always ringing, much to his or her delight. These fundamental differences may generate misunderstanding and conflict, aggravated by Taurean obstinacy. But the Taurus is easily enchanted by Gemini's liveliness, and Gemini finds a Taurus partner provides the security and stability he or she lacks."
	},
	"3_3": {
		"career": "Two Gemini working together as a team is almost like having four people on the job! The symbol for this air sign is the Twins because there is a distinctive duality in the Gemini's personality. One side is communicative, upbeat, imaginative, and productive, while the other is often gloomy, self-centered, reserved, and stubborn. When two Gemini's come together, they generally find a real connection. They are able to bolster each other during challenging times and inspire and motivate each other during work projects.\n\nThere can be challenges when one Gemini is not feeling upbeat and the other is. More likely though, conflict can happen when both are feeling downhearted. Communicating is one of this sign's greatest attributes. A pep talk or chat about the difficulties should quickly clear the air.",
		"friendship": "Geminis have a knack for spotting each other from across a crowded room. They're usually in crowded rooms, since they are such social creatures. Intelligent, witty, and charming, Gemini loves a good discussion. That's why they enjoy the company of other Twins. Masters of trivia, these two friends swap facts and anecdotes the way kids trade baseball cards. When these two get bored of one another, they'll easily part ways but then come together later, when they have more stories to share. Jealousy is rarely part of this friendship's equation.",
		"love": "When a dual sign meets up with its alter ego, anything can happen! Optimistic, communicative, and crackling with energy, they zoom along in the fast lane in total harmony. The Gemini sense of humor neutralizes conflicts, native curiosity electrifies their conversations, and their mutual fascination nourishes their love - which thrives on the prodigious sexual imagination they display. Romanticism is not on the menu, but many a spicy dish! The only hazard is their fluctuating nature. But as long as they share the same breeze, there's nothing to fear."
	},
	"1_2": {
		"career": "The combination of an energetic Aries with a hard-working Taurus is certain to bring results. One of the Aries greatest talents is initiating new ideas and projects. When backed up by Taurus' dedication to get down to the task at hand, with a no-fear attitude of getting their hands dirty if need be, work is launched and completed. The fire of the Aries makes almost anything possible, while the earth element of the Taurus keeps focus grounded. This is an excellent partnership! Although challenges are few in number with this well-suited team, there can be some obstacles. The energetic, fiery Aries moves fast, striving to reach the finish line first. Often the Taurus is slow and methodical in their approach. Patience is the key. It will not do any good to rush the Taurus!",
		"friendship": "Aries likes to look before they leap. Taurus prefers weighing their options. This dynamic can result in power struggles or it can be mutually beneficial. Aries can help Taurus become more strategically spontaneous, springing into action at the opportune moment. Taurus will assist Aries in getting better value from their work, relationships, and creative efforts. Occasionally, it will be best to leave each other alone. Trying to change one another will just undermine the value of this friendship. Viva la difference!",
		"love": "One drives the couple forward; the other stabilizes it. Aries rushes in with enthusiasm, whereas Taurus takes the time to think and slows the pair down. In bed, these differences make for a spicy and passionate relationship. The former finds needed common sense and security with the latter, whereas the latter delights in the former's spontaneity and fury... as long as Aries doesn't upset the other's daily routine too much, or arouse jealousy."
	},
	"2_2": {
		"career": "The Taurus personality is conservative, practical, reliable, and enduring. Adept at business, this makes for a powerful team in the office. Generally speaking, working together will be very industrious and profitable.There will be challenges, however. The earthy Taurus can be quite stubborn and set in their ways. When one or the other is unwilling to be flexible as to how work should be performed, conflict may arise. Provided both agree on one way to do the job, all will go well. When differing, each will need to pull back and truly consider the other's point of view before sticking to their guns. Taking some time to work separately might help matters tremendously.",
		"friendship": "When two Bulls form a friendship, pure pleasure ensues. These two have highly developed senses. A deep appreciation for food, art, and luxury usually brings them together. A profound love of relaxation cements their bond. Although this pair may not accomplish very much together, they'll have a great time nonetheless. They love nothing more than kicking back, relaxing and laughing together. When they disagree, neither will budge, so that can be difficult. If they argue over where to eat or which movie to see, it's best to flip a coin.",
		"love": "This is a solid couple (if such a thing exists), loyal and sensual, whose moral and physical love is ruled by the goddess Venus. A shared taste for luxury, culture, beautiful possessions, nature, and material prosperity convinces each that he or she has chosen the best match. Nothing is accidental, and every event is carefully thought out. Although the legendary Taurus stubbornness can become a source of conflict, there are no other obstacles to a serene and long-lasting commitment. In fact, it may even be a little too serene."
	},
	"1_1": {
		"career": "A highly charged, competitive atmosphere is sure to be present when two Aries work together. Both are born leaders and strive to do the very best possible. This dynamic team can move mountains when combining their fiery forces. Creative juices will flow when ideas are bounced back and forth, and there'll never be any lack of motivation to get projects off the ground. When this team takes on a challenge, success is pretty much guaranteed.\n\nChallenges can occur when this pair isn't willing to hear the other person out. Further conflict can arise when competitive energy is directed at one another, rather than combined towards a specific goal. Each Aries needs to know they are valued and respected to be able to work to their full potential.",
		"friendship": "These two signs are molded by the planet Mars, so they'll lock horns frequently in small spats. Occasionally, they'll take things up a notch and create some real drama together. Aries are very protective of their personal space, so each member of this team should take pains to respect the other's domain. When these two show respect for each other's talent, things will go smoothly. They should also take turns assuming the leadership role. When forming a united front, nothing can stop this dynamic duo.",
		"love": "Two personalities governed by the planet Mars are liable to lock horns frequently in combat. Each clearly stakes out a personal territory, a turf where the Aries individuality is asserted, and it requires the unconditional respect of the other. Harmony can reign only in the presence of a powerful, shared ideal which acts to channel the awesome energy of each and unites their strengths instead of opposing them. Together, they can generate megawatts! The love which binds them is impulsive, fiery, and impatient."
	}
}